ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#ifndef __SWM330_H__
#define __SWM330_H__

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */
typedef enum IRQn
{
/******  Cortex-M33 Processor Exceptions Numbers **********************************************/
  NonMaskableInt_IRQn     = -14,    /*!< 2 Non Maskable Interrupt                        */
  MemoryManagement_IRQn   = -12,    /*!< 4 Cortex-M33 Memory Management Interrupt         */
  BusFault_IRQn           = -11,    /*!< 5 Cortex-M33 Bus Fault Interrupt                 */
  UsageFault_IRQn         = -10,    /*!< 6 Cortex-M33 Usage Fault Interrupt               */
  SVCall_IRQn             = -5,     /*!< 11 Cortex-M33 SV Call Interrupt                  */
  DebugMonitor_IRQn       = -4,     /*!< 12 Cortex-M33 Debug Monitor Interrupt            */
  PendSV_IRQn             = -2,     /*!< 14 Cortex-M33 Pend SV Interrupt                  */
  SysTick_IRQn            = -1,     /*!< 15 Cortex-M33 System Tick Interrupt              */
  
/******  Cortex-M33 specific Interrupt Numbers ************************************************/
  UART0_IRQn              = 0,
  UART1_IRQn              = 1,
  UART2_IRQn              = 2,
  UART3_IRQn              = 3,
  UART4_IRQn              = 4,
  PWM0_IRQn               = 5,
  PWM1_IRQn               = 6,
  PWMBRK_IRQn             = 7,
  SPI0_IRQn               = 8,
  I2S0_IRQn               = 9,
  ADC0_IRQn               = 10,
  BTIMR0_IRQn             = 11,
  BTIMR1_IRQn             = 12,
  BTIMR2_IRQn             = 13,
  BTIMR3_IRQn             = 14,
  TIMR0_IRQn              = 15,
  TIMR1_IRQn              = 16,
  CAN0_IRQn               = 17,
  I2C0_IRQn               = 18,
  I2C1_IRQn               = 19,
  DMA_IRQn                = 20,
  DMA2D_IRQn              = 21,
  BOD_IRQn                = 22,
  QSPI0_IRQn              = 23,
  QSPI1_IRQn              = 24,
  SRA_IRQn                = 25,
  DVP_IRQn                = 26,
  LCD_IRQn                = 27,
  JPEG_IRQn               = 28,
  SDIO_IRQn               = 29,
  WDT_IRQn                = 30,
  RTC_IRQn                = 31,
  EXTI0_IRQn              = 32,
  EXTI1_IRQn              = 33,
  EXTI2_IRQn              = 34,
  EXTI3_IRQn              = 35,
  EXTI4_IRQn              = 36,
  EXTI5_IRQn              = 37,
  EXTI6_IRQn              = 38,
  EXTI7_IRQn              = 39,
  EXTI8_11_IRQn           = 40,
  EXTI12_15_IRQn          = 41,
  XTALSTOP_IRQn			  = 42,
  RDMA_IRQn				  = 43,
} IRQn_Type;

/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M33 Processor and Core Peripherals */
#define __CM33_REV                0x0000  /*!< Core revision r0p1                            */
#define __NVIC_PRIO_BITS          3       /*!< SWM330 uses 3 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used  */
#define __DSP_PRESENT             1		  /*!< DSP extension present                         */
#define __FPU_PRESENT             0       /*!< FPU present                                   */
#define __MPU_PRESENT             1       /*!< MPU present                                   */

#if   defined ( __CC_ARM )
  #pragma anon_unions
#endif

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include "core_cm33.h"
#include "system_SWM330.h"


/******************************************************************************/
/*				Device Specific Peripheral registers structures			 */
/******************************************************************************/
typedef struct {
	__IO uint32_t CLKSEL;				    // Clock Select

	__IO uint32_t CLKDIVx_ON;				// [0] CLK_DIVx clock source switch

	__IO uint32_t CLKEN0;					// Clock Enable
	
	__IO uint32_t CLKEN1;
	
	__IO uint32_t MODE;
	
		 uint32_t RESERVED[4];
	
	__IO uint32_t RSTSR;					// Reset Status
	
		 uint32_t RESERVED2[2];
	
	__IO uint32_t RTCWKCR;					// RTC Wakeup Control
	
	__IO uint32_t RTCWKSR;
	
	__IO uint32_t PSDLYADJ;					// PSRAM Delay ADJ
	
		 uint32_t RESERVED3[17];
	
	__I  uint32_t CHIPID[4];
	
	__IO uint32_t BACKUP[6];				// Data Backup Register
	
		 uint32_t RESERVED4[22];
	
	__IO uint32_t PAWKEN;				    // PORTA Wakeup Enable
	__IO uint32_t PBWKEN;
	__IO uint32_t PCWKEN;
	__IO uint32_t PDWKEN;
	__IO uint32_t PEWKEN;
	
         uint32_t RESERVED5[7];
	
	__IO uint32_t PAWKSR;				    // PORTA Wakeup Status, Write 1 to clear
	__IO uint32_t PBWKSR;
	__IO uint32_t PCWKSR;
	__IO uint32_t PDWKSR;
	__IO uint32_t PEWKSR;
	
		 uint32_t RESERVED6[(0x720-0x140)/4-1];
	
	__IO uint32_t PRSTEN;					// Peripheral reset enabled. PRSTR0 and PRSTR1 can be written only when the value of PRSTEN is 0x55
	__IO uint32_t PRSTR0;
	__IO uint32_t PRSTR1;
	
    //Analog Control: 0x400A5800
         uint32_t RESERVED7[(0x400A5800-0x40000728)/4-1];
	
	__IO uint32_t RCCR;						// High speed RC Control Register
		 uint32_t RESERVED8;
    
	__IO uint32_t XTALCR;
	__IO uint32_t XTALSR;
	
	__IO uint32_t PLLCR;
    __IO uint32_t PLLDIV;
		 uint32_t RESERVED9;
    __IO uint32_t PLLSSCG;
	
    __IO uint32_t BODCR;
	__IO uint32_t BODSR;
	
	__IO uint32_t ADCCR;
	
	__IO uint32_t PWRCR;
	
		 uint32_t RESERVED10[3];
	
	__IO uint32_t TEMPCR;					// Temperature Sensor
} SYS_TypeDef;


#define SYS_CLKSEL_SYS_Pos			0		// System clock select, 1 HRC, 0 CLK_DIVx
#define SYS_CLKSEL_SYS_Msk			(0x01 << SYS_CLKSEL_SYS_Pos)
#define SYS_CLKSEL_CLK_DIVx_Pos		1		// CLK_DIVx clock select, 0 CLK_DIV1, 1 CLK_DIV8
#define SYS_CLKSEL_CLK_DIVx_Msk		(0x01 << SYS_CLKSEL_CLK_DIVx_Pos)
#define SYS_CLKSEL_CLK_Pos			2		// Clock Source, 0 LRC, 1 PLL, 2 XTAL_32K, 3 XTAL, 4 HRC
#define SYS_CLKSEL_CLK_Msk			(0x07 << SYS_CLKSEL_CLK_Pos)
#define SYS_CLKSEL_SDIO_Pos			7		// SDIO clock select, 0 SYSCLK/2, 1 SYSCLK/8, 2 SYSCLK/4, 3 SYSCLK
#define SYS_CLKSEL_SDIO_Msk			(0x03 << SYS_CLKSEL_SDIO_Pos)
#define SYS_CLKSEL_WDT_Pos			9		// WDT clock select, 0 HRC, 1 XTAL, 2 LRC, 3 XTAL_32K
#define SYS_CLKSEL_WDT_Msk			(0x03 << SYS_CLKSEL_WDT_Pos)
#define SYS_CLKSEL_SLEEP_Pos		11		// sleep clock, 0 LRC, 1 XTAL_32K
#define SYS_CLKSEL_SLEEP_Msk		(0x01 << SYS_CLKSEL_SLEEP_Pos)

