ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define SYS_CLKDIV_ON_Pos           0
#define SYS_CLKDIV_ON_Msk           (0x01 << SYS_CLKDIV_ON_Pos)

#define SYS_CLKEN0_GPIOA_Pos		0
#define SYS_CLKEN0_GPIOA_Msk		(0x01 << SYS_CLKEN0_GPIOA_Pos)
#define SYS_CLKEN0_GPIOB_Pos		1
#define SYS_CLKEN0_GPIOB_Msk		(0x01 << SYS_CLKEN0_GPIOB_Pos)
#define SYS_CLKEN0_GPIOC_Pos		2
#define SYS_CLKEN0_GPIOC_Msk		(0x01 << SYS_CLKEN0_GPIOC_Pos)
#define SYS_CLKEN0_GPIOD_Pos		3
#define SYS_CLKEN0_GPIOD_Msk		(0x01 << SYS_CLKEN0_GPIOD_Pos)
#define SYS_CLKEN0_SPI0_Pos			4
#define SYS_CLKEN0_SPI0_Msk			(0x01 << SYS_CLKEN0_SPI0_Pos)
#define SYS_CLKEN0_I2S0_Pos			5
#define SYS_CLKEN0_I2S0_Msk			(0x01 << SYS_CLKEN0_I2S0_Pos)
#define SYS_CLKEN0_DAC0_Pos			6
#define SYS_CLKEN0_DAC0_Msk			(0x01 << SYS_CLKEN0_DAC0_Pos)
#define SYS_CLKEN0_ADC0_Pos			7
#define SYS_CLKEN0_ADC0_Msk			(0x01 << SYS_CLKEN0_ADC0_Pos)
#define SYS_CLKEN0_TIMR_Pos			8
#define SYS_CLKEN0_TIMR_Msk			(0x01 << SYS_CLKEN0_TIMR_Pos)
#define SYS_CLKEN0_BTIMR_Pos		9
#define SYS_CLKEN0_BTIMR_Msk		(0x01 << SYS_CLKEN0_BTIMR_Pos)
#define SYS_CLKEN0_PWM_Pos			10
#define SYS_CLKEN0_PWM_Msk			(0x01 << SYS_CLKEN0_PWM_Pos)
#define SYS_CLKEN0_SDIO_Pos			11
#define SYS_CLKEN0_SDIO_Msk			(0x01 << SYS_CLKEN0_SDIO_Pos)
#define SYS_CLKEN0_LCD_Pos			12
#define SYS_CLKEN0_LCD_Msk			(0x01 << SYS_CLKEN0_LCD_Pos)
#define SYS_CLKEN0_CRC_Pos			13
#define SYS_CLKEN0_CRC_Msk			(0x01 << SYS_CLKEN0_CRC_Pos)
#define SYS_CLKEN0_QSPI0_Pos		14
#define SYS_CLKEN0_QSPI0_Msk		(0x01 << SYS_CLKEN0_QSPI0_Pos)
#define SYS_CLKEN0_QSPI1_Pos		15
#define SYS_CLKEN0_QSPI1_Msk		(0x01 << SYS_CLKEN0_QSPI1_Pos)
#define SYS_CLKEN0_SRA_Pos			16
#define SYS_CLKEN0_SRA_Msk			(0x01 << SYS_CLKEN0_SRA_Pos)
#define SYS_CLKEN0_DMA2D_Pos		17
#define SYS_CLKEN0_DMA2D_Msk		(0x01 << SYS_CLKEN0_DMA2D_Pos)
#define SYS_CLKEN0_JPEG_Pos			18
#define SYS_CLKEN0_JPEG_Msk			(0x01 << SYS_CLKEN0_JPEG_Pos)
#define SYS_CLKEN0_DVP_Pos			19
#define SYS_CLKEN0_DVP_Msk			(0x01 << SYS_CLKEN0_DVP_Pos)
#define SYS_CLKEN0_PSRAM_Pos		20
#define SYS_CLKEN0_PSRAM_Msk		(0x01 << SYS_CLKEN0_PSRAM_Pos)
#define SYS_CLKEN0_RDMA_Pos			21
#define SYS_CLKEN0_RDMA_Msk			(0x01 << SYS_CLKEN0_RDMA_Pos)

#define SYS_CLKEN1_WDT_Pos			0
#define SYS_CLKEN1_WDT_Msk			(0x01 << SYS_CLKEN1_WDT_Pos)
#define SYS_CLKEN1_UART0_Pos		1
#define SYS_CLKEN1_UART0_Msk		(0x01 << SYS_CLKEN1_UART0_Pos)
#define SYS_CLKEN1_UART1_Pos		2
#define SYS_CLKEN1_UART1_Msk		(0x01 << SYS_CLKEN1_UART1_Pos)
#define SYS_CLKEN1_UART2_Pos		3
#define SYS_CLKEN1_UART2_Msk		(0x01 << SYS_CLKEN1_UART2_Pos)
#define SYS_CLKEN1_UART3_Pos		4
#define SYS_CLKEN1_UART3_Msk		(0x01 << SYS_CLKEN1_UART3_Pos)
#define SYS_CLKEN1_UART4_Pos		5
#define SYS_CLKEN1_UART4_Msk		(0x01 << SYS_CLKEN1_UART4_Pos)
#define SYS_CLKEN1_RTC_Pos			6
#define SYS_CLKEN1_RTC_Msk			(0x01 << SYS_CLKEN1_RTC_Pos)
#define SYS_CLKEN1_I2C0_Pos			7
#define SYS_CLKEN1_I2C0_Msk			(0x01 << SYS_CLKEN1_I2C0_Pos)
#define SYS_CLKEN1_I2C1_Pos			8
#define SYS_CLKEN1_I2C1_Msk			(0x01 << SYS_CLKEN1_I2C1_Pos)
#define SYS_CLKEN1_CAN0_Pos			9
#define SYS_CLKEN1_CAN0_Msk			(0x01 << SYS_CLKEN1_CAN0_Pos)
#define SYS_CLKEN1_ANAC_Pos			10
#define SYS_CLKEN1_ANAC_Msk			(0x01 << SYS_CLKEN1_ANAC_Pos)
#define SYS_CLKEN1_GPIOE_Pos		11
#define SYS_CLKEN1_GPIOE_Msk		(0x01 << SYS_CLKEN1_GPIOE_Pos)

#define SYS_MODE_WKEDGE_Pos			0		// Wakeup edge: 0 falling edge, 1 rising edge
#define SYS_MODE_WKEDGE_Msk			(0x01 << SYS_MODE_WKEDGE_Pos)

#define SYS_RSTSR_POR_Pos			0		// POR reset happened, write 1 to clear
#define SYS_RSTSR_POR_Msk			(0x01 << SYS_RSTSR_POR_Pos)
#define SYS_RSTSR_WDT_Pos			1		// WDT reset happened, write 1 to clear
#define SYS_RSTSR_WDT_Msk			(0x01 << SYS_RSTSR_WDT_Pos)
#define SYS_RSTSR_BOD_Pos			2		// BOD reset happened, write 1 to clear
#define SYS_RSTSR_BOD_Msk			(0x01 << SYS_RSTSR_BOD_Pos)

#define SYS_RTCWKCR_EN_Pos			0		// RTC wakeup enable
#define SYS_RTCWKCR_EN_Msk			(0x01 << SYS_RTCWKCR_EN_Pos)
#define SYS_RTCWKCR_WREN_Pos		1		// RTC register write enable
#define SYS_RTCWKCR_WREN_Msk		(0x01 << SYS_RTCWKCR_WREN_Pos)

#define SYS_RTCWKSR_FLAG_Pos		0		// RTC wakeup flag, write 1 to clear
#define SYS_RTCWKSR_FLAG_Msk		(0x01 << SYS_RTCWKSR_FLAG_Pos)

#define SYS_PSDLYADJ_DQS100_Pos		0		// DQS signal delay fine-tuned, 100ps step
#define SYS_PSDLYADJ_DQS100_Msk		(0x03 << SYS_PSDLYADJ_DQS100_Pos)
#define SYS_PSDLYADJ_DQS400_Pos		2		// DQS signal delay coarse adjustment, 400ps step
#define SYS_PSDLYADJ_DQS400_Msk		(0x03 << SYS_PSDLYADJ_DQS400_Pos)
#define SYS_PSDLYADJ_CLK100_Pos		8
#define SYS_PSDLYADJ_CLK100_Msk		(0x03 << SYS_PSDLYADJ_CLK100_Pos)
#define SYS_PSDLYADJ_CLK400_Pos		10
#define SYS_PSDLYADJ_CLK400_Msk		(0x03 << SYS_PSDLYADJ_CLK400_Pos)

#define SYS_PRSTR0_GPIOA_Pos		0
#define SYS_PRSTR0_GPIOA_Msk		(0x01 << SYS_PRSTR0_GPIOA_Pos)
#define SYS_PRSTR0_GPIOB_Pos		1
#define SYS_PRSTR0_GPIOB_Msk		(0x01 << SYS_PRSTR0_GPIOB_Pos)
#define SYS_PRSTR0_GPIOC_Pos		2
#define SYS_PRSTR0_GPIOC_Msk		(0x01 << SYS_PRSTR0_GPIOC_Pos)
#define SYS_PRSTR0_GPIOD_Pos		3
#define SYS_PRSTR0_GPIOD_Msk		(0x01 << SYS_PRSTR0_GPIOD_Pos)
#define SYS_PRSTR0_SPI0_Pos			4
#define SYS_PRSTR0_SPI0_Msk			(0x01 << SYS_PRSTR0_SPI0_Pos)
#define SYS_PRSTR0_I2S0_Pos			5
#define SYS_PRSTR0_I2S0_Msk			(0x01 << SYS_PRSTR0_I2S0_Pos)
#define SYS_PRSTR0_DAC0_Pos			6
#define SYS_PRSTR0_DAC0_Msk			(0x01 << SYS_PRSTR0_DAC0_Pos)
#define SYS_PRSTR0_ADC0_Pos			7
#define SYS_PRSTR0_ADC0_Msk			(0x01 << SYS_PRSTR0_ADC0_Pos)
#define SYS_PRSTR0_TIMR_Pos			8
#define SYS_PRSTR0_TIMR_Msk			(0x01 << SYS_PRSTR0_TIMR_Pos)
#define SYS_PRSTR0_BTIMR_Pos		9
#define SYS_PRSTR0_BTIMR_Msk		(0x01 << SYS_PRSTR0_BTIMR_Pos)
#define SYS_PRSTR0_PWM_Pos			10
#define SYS_PRSTR0_PWM_Msk			(0x01 << SYS_PRSTR0_PWM_Pos)
#define SYS_PRSTR0_SDIO_Pos			11
#define SYS_PRSTR0_SDIO_Msk			(0x01 << SYS_PRSTR0_SDIO_Pos)
#define SYS_PRSTR0_LCD_Pos			12
#define SYS_PRSTR0_LCD_Msk			(0x01 << SYS_PRSTR0_LCD_Pos)
#define SYS_PRSTR0_CRC_Pos			13
#define SYS_PRSTR0_CRC_Msk			(0x01 << SYS_PRSTR0_CRC_Pos)
#define SYS_PRSTR0_QSPI0_Pos		14
#define SYS_PRSTR0_QSPI0_Msk		(0x01 << SYS_PRSTR0_QSPI0_Pos)
#define SYS_PRSTR0_QSPI1_Pos		15
#define SYS_PRSTR0_QSPI1_Msk		(0x01 << SYS_PRSTR0_QSPI1_Pos)
#define SYS_PRSTR0_SRA_Pos			16
#define SYS_PRSTR0_SRA_Msk			(0x01 << SYS_PRSTR0_SRA_Pos)
#define SYS_PRSTR0_DMA2D_Pos		17
#define SYS_PRSTR0_DMA2D_Msk		(0x01 << SYS_PRSTR0_DMA2D_Pos)
#define SYS_PRSTR0_JPEG_Pos			18
#define SYS_PRSTR0_JPEG_Msk			(0x01 << SYS_PRSTR0_JPEG_Pos)
#define SYS_PRSTR0_DVP_Pos			19
#define SYS_PRSTR0_DVP_Msk			(0x01 << SYS_PRSTR0_DVP_Pos)
#define SYS_PRSTR0_PSRAM_Pos		20
#define SYS_PRSTR0_PSRAM_Msk		(0x01 << SYS_PRSTR0_PSRAM_Pos)
#define SYS_PRSTR0_RDMA_Pos			21
#define SYS_PRSTR0_RDMA_Msk			(0x01 << SYS_PRSTR0_RDMA_Pos)

#define SYS_PRSTR1_WDT_Pos			0
#define SYS_PRSTR1_WDT_Msk			(0x01 << SYS_PRSTR1_WDT_Pos)
#define SYS_PRSTR1_UART0_Pos		1
#define SYS_PRSTR1_UART0_Msk		(0x01 << SYS_PRSTR1_UART0_Pos)
#define SYS_PRSTR1_UART1_Pos		2
#define SYS_PRSTR1_UART1_Msk		(0x01 << SYS_PRSTR1_UART1_Pos)
#define SYS_PRSTR1_UART2_Pos		3
#define SYS_PRSTR1_UART2_Msk		(0x01 << SYS_PRSTR1_UART2_Pos)
#define SYS_PRSTR1_UART3_Pos		4
#define SYS_PRSTR1_UART3_Msk		(0x01 << SYS_PRSTR1_UART3_Pos)
#define SYS_PRSTR1_UART4_Pos		5
#define SYS_PRSTR1_UART4_Msk		(0x01 << SYS_PRSTR1_UART4_Pos)
#define SYS_PRSTR1_RTC_Pos			6
#define SYS_PRSTR1_RTC_Msk			(0x01 << SYS_PRSTR1_RTC_Pos)
#define SYS_PRSTR1_I2C0_Pos			7
#define SYS_PRSTR1_I2C0_Msk			(0x01 << SYS_PRSTR1_I2C0_Pos)
#define SYS_PRSTR1_I2C1_Pos			8
#define SYS_PRSTR1_I2C1_Msk			(0x01 << SYS_PRSTR1_I2C1_Pos)
#define SYS_PRSTR1_CAN0_Pos			9
#define SYS_PRSTR1_CAN0_Msk			(0x01 << SYS_PRSTR1_CAN0_Pos)
#define SYS_PRSTR1_ANAC_Pos			10
#define SYS_PRSTR1_ANAC_Msk			(0x01 << SYS_PRSTR1_ANAC_Pos)
#define SYS_PRSTR1_GPIOE_Pos		11
#define SYS_PRSTR1_GPIOE_Msk		(0x01 << SYS_PRSTR1_GPIOE_Pos)

