ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define SYS_RCCR_HON_Pos			0		// High speed RC ON
#define SYS_RCCR_HON_Msk			(0x01 << SYS_RCCR_HON_Pos)
#define SYS_RCCR_LON_Pos			1		// Low  speed RC ON
#define SYS_RCCR_LON_Msk			(0x01 << SYS_RCCR_LON_Pos)

#define SYS_XTALCR_ON_Pos			0		// XTAL On
#define SYS_XTALCR_ON_Msk			(0x01 << SYS_XTALCR_ON_Pos)
#define SYS_XTALCR_BYPASS_Pos		1
#define SYS_XTALCR_BYPASS_Msk		(0x01 << SYS_XTALCR_BYPASS_Pos)

#define SYS_XTALSR_32KSTOP_Pos		0		// XTAL_32K Stop flag, write 1 to clear
#define SYS_XTALSR_32KSTOP_Msk		(0x01 << SYS_XTALSR_32KSTOP_Pos)
#define SYS_XTALSR_STOP_Pos			1		// XTAL Stop flag, write 1 to clear
#define SYS_XTALSR_STOP_Msk			(0x01 << SYS_XTALSR_STOP_Pos)
#define SYS_XTALSR_32KSTOPDET_Pos	2		// XTAL_32K Stop Detect enable
#define SYS_XTALSR_32KSTOPDET_Msk	(0x01 << SYS_XTALSR_32KSTOPDET_Pos)
#define SYS_XTALSR_STOPDET_Pos		3		// XTAL Stop Detect enable
#define SYS_XTALSR_STOPDET_Msk		(0x01 << SYS_XTALSR_STOPDET_Pos)

#define SYS_PLLCR_OUTEN_Pos		    0       // can only be set after LOCK
#define SYS_PLLCR_OUTEN_Msk		    (0x01 << SYS_PLLCR_OUTEN_Pos)
#define SYS_PLLCR_INSEL_Pos		    1       // 0 XTAL, 1 HRC
#define SYS_PLLCR_INSEL_Msk		    (0x01 << SYS_PLLCR_INSEL_Pos)
#define SYS_PLLCR_OFF_Pos		    2
#define SYS_PLLCR_OFF_Msk		    (0x01 << SYS_PLLCR_OFF_Pos)
#define SYS_PLLCR_LOCK_Pos			3
#define SYS_PLLCR_LOCK_Msk			(0x01 << SYS_PLLCR_LOCK_Pos)
#define SYS_PLLCR_SSCG_Pos			4		// Spread Spectrum Clock Generator, 0 off
#define SYS_PLLCR_SSCG_Msk			(0x03 << SYS_PLLCR_SSCG_Pos)
#define SYS_PLLCR_SDMMOD_Pos		6		// SDM module
#define SYS_PLLCR_SDMMOD_Msk		(0xFFF<< SYS_PLLCR_SDMMOD_Pos)
#define SYS_PLLCR_FBDIVFP_Pos		18		// PLL FeedBack divider fractional part
#define SYS_PLLCR_FBDIVFP_Msk		(0xFFF<< SYS_PLLCR_FBDIVFP_Pos)

#define SYS_PLLDIV_OUTDIV_Pos		0      	// PLL output clock divider, 0 div1, 1 div2, ..., 7 div8
#define SYS_PLLDIV_OUTDIV_Msk		(0x07 << SYS_PLLDIV_OUTDIV_Pos)
#define SYS_PLLDIV_FBDIV_Pos		8       // PLL FeedBack divider
#define SYS_PLLDIV_FBDIV_Msk		(0x3F << SYS_PLLDIV_FBDIV_Pos)
#define SYS_PLLDIV_INDIV_Pos		16      // PLL input clock divider, 0 div1, 1 div2, ..., 7 div8
#define SYS_PLLDIV_INDIV_Msk		(0x07 << SYS_PLLDIV_INDIV_Pos)

#define SYS_PLLSSCG_PFDDIV_Pos		0		// phase discriminator divider
#define SYS_PLLSSCG_PFDDIV_Msk		(0x7F << SYS_PLLSSCG_PFDDIV_Pos)
#define SYS_PLLSSCG_NSTEP_Pos		8		// Number of steps of triangular wave modulation
#define SYS_PLLSSCG_NSTEP_Msk		(0x1FF<< SYS_PLLSSCG_NSTEP_Pos)
#define SYS_PLLSSCG_FRACSTEP_Pos	24
#define SYS_PLLSSCG_FRACSTEP_Msk	(0xFFu<< SYS_PLLSSCG_FRACSTEP_Pos)

#define SYS_BODCR_EN_Pos			0
#define SYS_BODCR_EN_Msk			(0x01 << SYS_BODCR_EN_Pos)
#define SYS_BODCR_IE_Pos		    1		// Interrupt Enable
#define SYS_BODCR_IE_Msk		    (0x01 << SYS_BODCR_IE_Pos)
#define SYS_BODCR_LVL_Pos			8		// BOD threshold level
#define SYS_BODCR_LVL_Msk			(0x03 << SYS_BODCR_LVL_Pos)
#define SYS_BODCR_VDDSW_Pos			10		// 1: use BOD output to control the VDDSW switch
#define SYS_BODCR_VDDSW_Msk			(0x01 << SYS_BODCR_VDDSW_Pos)

#define SYS_BODSR_IF_Pos			0		// interrupt flag, write 1 to clear
#define SYS_BODSR_IF_Msk			(0x01 << SYS_BODSR_IF_Pos)
#define SYS_BODSR_ST_Pos			1		// BOD Status
#define SYS_BODSR_ST_Msk			(0x01 << SYS_BODSR_ST_Pos)

#define SYS_ADCCR_IVREN_Pos			0		// ADC Internal Vref Enable
#define SYS_ADCCR_IVREN_Msk			(0x01 << SYS_ADCCR_IVREN_Pos)
#define SYS_ADCCR_IVRSEL_Pos		1		// ADC Internal Vref Select
#define SYS_ADCCR_IVRSEL_Msk		(0x01 << SYS_ADCCR_IVRSEL_Pos)

#define SYS_TEMPCR_EN_Pos			0
#define SYS_TEMPCR_EN_Msk			(0x01 << SYS_TEMPCR_EN_Pos)




typedef struct {
	__IO uint32_t FUNC0;					// pin function select
	
	__IO uint32_t FUNC1;
	
		 uint32_t RESERVED[62];
	
    __IO uint32_t PULLU;              		// pull-up enable
    
         uint32_t RESERVED2[63];
    
    __IO uint32_t PULLD;	              	// pull-down enable
    
         uint32_t RESERVED3[63];
    
    __IO uint32_t INEN;               		// input enable
    
         uint32_t RESERVED4[63];

	__IO uint32_t OPEND;              		// open-drain enable
	
		 uint32_t RESERVED5[63];
	
	__IO uint32_t DRVS;
	
		 uint32_t RESERVED6[63];
	
	__IO uint32_t SLEW;
	
		 uint32_t RESERVED7[63];
	
	__IO uint32_t FUNMUX0;
	
	__IO uint32_t FUNMUX1;
	
	__IO uint32_t FUNMUX2;
} PORT_TypeDef;




typedef struct {
	__IO uint32_t ODR;
#define PIN0    0
#define PIN1    1
#define PIN2    2
#define PIN3    3
#define PIN4    4
#define PIN5    5
#define PIN6    6
#define PIN7    7
#define PIN8    8
#define PIN9    9
#define PIN10   10
#define PIN11   11
#define PIN12   12
#define PIN13   13
#define PIN14   14
#define PIN15   15

	__IO uint32_t DIR;					    // 0 input, 1 output

	__IO uint32_t INTLVLTRG;				// Interrupt Level Trigger, 1 level trigger, 0 edge trigger

	__IO uint32_t INTBE;					// Both Edge

	__IO uint32_t INTRISEEN;				// Interrupt Rise Edge Enable, 1 rise-edge or high-level trigger, 0 fall-edge or low-level trigger

	__IO uint32_t INTEN;					// interrupt enable

	__I  uint32_t INTRAWSTAT;			    // interrupt raw state

	__I  uint32_t INTSTAT;				    // INTSTAT.PIN0 = INTRAWSTAT.PIN0 & INTEN.PIN0

	__O  uint32_t INTCLR;				    // interrupt flag clear
		
		 uint32_t RESERVED[3];
	
	__I  uint32_t IDR;
	
		 uint32_t RESERVED2[3];
	
	__IO uint32_t DATAPIN0;
	__IO uint32_t DATAPIN1;
	__IO uint32_t DATAPIN2;
	__IO uint32_t DATAPIN3;
	__IO uint32_t DATAPIN4;
	__IO uint32_t DATAPIN5;
	__IO uint32_t DATAPIN6;
	__IO uint32_t DATAPIN7;
	__IO uint32_t DATAPIN8;
	__IO uint32_t DATAPIN9;
	__IO uint32_t DATAPIN10;
	__IO uint32_t DATAPIN11;
	__IO uint32_t DATAPIN12;
	__IO uint32_t DATAPIN13;
	__IO uint32_t DATAPIN14;
	__IO uint32_t DATAPIN15;
} GPIO_TypeDef;




typedef struct {
	__IO uint32_t LOAD;						// reload value

	__I  uint32_t VALUE;					// current value, counting down from LOAD

	__IO uint32_t CR;
	
		 uint32_t RESERVED;
	
	__IO uint32_t IE;
		
	__IO uint32_t IF;
	
	__IO uint32_t HALT;						// 1 halt counting
	
	__IO uint32_t OCCR;
	__IO uint32_t OCMAT;
	
	__IO uint32_t RESERVED2;
	
	__IO uint32_t ICLOW;
	__IO uint32_t ICHIGH;
	
	__IO uint32_t PREDIV;					// prescale, 8-bit width
} TIMR_TypeDef;


#define TIMR_LOAD_VALUE_Pos			0
#define TIMR_LOAD_VALUE_Msk			(0xFFFFFF << TIMR_LOAD_VALUE_Pos)
#define TIMR_LOAD_RELOAD_Pos		24		// reload VALUE to TIMR's internal Counter immediately. only for BTIMRx, not for TIMRx.
#define TIMR_LOAD_RELOAD_Msk		(0x01 << TIMR_LOAD_RELOAD_Pos)

