ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
typedef struct {
	__IO uint32_t CR1;
	
	__IO uint32_t DR;
	
	__IO uint32_t IE;
	
	__IO uint32_t SR;
	
	__IO uint32_t CR2;
	
	__IO uint32_t CR3;
} I2S_TypeDef;


#define I2S_CR1_DMATXEN_Pos			0
#define I2S_CR1_DMATXEN_Msk			(0x01 << I2S_CR1_DMATXEN_Pos)
#define I2S_CR1_DMARXEN_Pos			1
#define I2S_CR1_DMARXEN_Msk			(0x01 << I2S_CR1_DMARXEN_Pos)
#define I2S_CR1_FILTE_Pos			2		// 1 de-bounce input signal
#define I2S_CR1_FILTE_Msk			(0x01 << I2S_CR1_FILTE_Pos)
#define I2S_CR1_NSYNC_Pos			11		// 1 not Synchronize input signal
#define I2S_CR1_NSYNC_Msk			(0x01 << I2S_CR1_NSYNC_Pos)

#define I2S_IE_UDR_Pos				0		// TX Buffer underflow interrupt enable, used for slave mode
#define I2S_IE_UDR_Msk				(0x01 << I2S_IE_UDR_Pos)
#define I2S_IE_OVR_Pos				1		// RX Buffer overflow interrupt enable
#define I2S_IE_OVR_Msk				(0x01 << I2S_IE_OVR_Pos)
#define I2S_IE_RXNE_Pos				2		// RX Buffer Not Empty
#define I2S_IE_RXNE_Msk				(0x01 << I2S_IE_RXNE_Pos)
#define I2S_IE_TXE_Pos				3		// TX Buffer Empty
#define I2S_IE_TXE_Msk				(0x01 << I2S_IE_TXE_Pos)

#define I2S_SR_UDRIF_Pos			0		// write 1 to clear
#define I2S_SR_UDRIF_Msk			(0x01 << I2S_SR_UDRIF_Pos)
#define I2S_SR_OVRIF_Pos			1
#define I2S_SR_OVRIF_Msk			(0x01 << I2S_SR_OVRIF_Pos)
#define I2S_SR_RXNEIF_Pos			2
#define I2S_SR_RXNEIF_Msk			(0x01 << I2S_SR_RXNEIF_Pos)
#define I2S_SR_TXEIF_Pos			3
#define I2S_SR_TXEIF_Msk			(0x01 << I2S_SR_TXEIF_Pos)
#define I2S_SR_TXE_Pos				4
#define I2S_SR_TXE_Msk				(0x01 << I2S_SR_TXE_Pos)
#define I2S_SR_RXNE_Pos				5
#define I2S_SR_RXNE_Msk				(0x01 << I2S_SR_RXNE_Pos)
#define I2S_SR_BUSY_Pos				6
#define I2S_SR_BUSY_Msk				(0x01 << I2S_SR_BUSY_Pos)

#define I2S_CR2_MODE_Pos			0		// 0 Slave TX   1 Slave RX   2 Master TX   3 Master RX
#define I2S_CR2_MODE_Msk			(0x03 << I2S_CR2_MODE_Pos)
#define I2S_CR2_CKPOL_Pos			2		// 0 low level when idle
#define I2S_CR2_CKPOL_Msk			(0x01 << I2S_CR2_CKPOL_Pos)
#define I2S_CR2_EN_Pos				3
#define I2S_CR2_EN_Msk				(0x01 << I2S_CR2_EN_Pos)
#define I2S_CR2_FFMT_Pos			4		// I2S Frame Format, 0 I2S philips, 1 MSB justified, 2 LSB justified, 3 PCM
#define I2S_CR2_FFMT_Msk			(0x03 << I2S_CR2_FFMT_Pos)
#define I2S_CR2_DLEN_Pos			6		// I2S Data Length,  0 8-bit, 1 16-bit, 2 24-bit, 3 32-bit
#define I2S_CR2_DLEN_Msk			(0x03 << I2S_CR2_DLEN_Pos)
#define I2S_CR2_PCMSYNW_Pos			8		// I2S PCM Sync Width, 0 1 SCLK period, 1 1 Data Length
#define I2S_CR2_PCMSYNW_Msk			(0x01 << I2S_CR2_PCMSYNW_Pos)
#define I2S_CR2_MCLKOE_Pos			9		// MCLK Output Enable
#define I2S_CR2_MCLKOE_Msk			(0x01 << I2S_CR2_MCLKOE_Pos)
#define I2S_CR2_CHLEN_Pos			10		// Channel width, 0 16-bit, 1 32-bit
#define I2S_CR2_CHLEN_Msk			(0x01 << I2S_CR2_CHLEN_Pos)
#define I2S_CR2_CHRIGHT_Pos			16		// 1 Right Channel, 0 Left Channel
#define I2S_CR2_CHRIGHT_Msk			(0x01 << I2S_CR2_CHRIGHT_Pos)

#define I2S_CR3_SCLKDIV_Pos			0
#define I2S_CR3_SCLKDIV_Msk			(0xFFF<< I2S_CR3_SCLKDIV_Pos)
#define I2S_CR3_SCLKODD_Pos			12		// 0: Fsclk = Fpclk / (SCLKDIV * 2), 1: Fsclk = Fpclk / (SCLKDIV * 2 + 1)
#define I2S_CR3_SCLKODD_Msk			(0xFFF << I2S_CR3_SCLKODD_Pos)




typedef struct {
	__IO uint32_t CR;

	__IO uint32_t SR;

	__IO uint32_t TR;						// Transfer Register

	__IO uint32_t RXDATA;
	
	__IO uint32_t TXDATA;
	
	__IO uint32_t IF;
	
	__IO uint32_t IE;
	
		 uint32_t RESERVED1;
	
	__IO uint32_t MCR;						// Master Control Register
	
	__IO uint32_t CLK;
	
		 uint32_t RESERVED2[2];
	
	__IO uint32_t SCR;						// Slave Control Register
	
	__IO uint32_t SADDR;
} I2C_TypeDef;


#define I2C_CR_EN_Pos				0	
#define I2C_CR_EN_Msk				(0x01 << I2C_CR_EN_Pos)
#define I2C_CR_MASTER_Pos			1		// Master mode
#define I2C_CR_MASTER_Msk			(0x01 << I2C_CR_MASTER_Pos)
#define I2C_CR_HS_Pos				2		// 1 High-Speed mode, 0 Standard-mode or Fast-mode
#define I2C_CR_HS_Msk				(0x01 << I2C_CR_HS_Pos)
#define I2C_CR_DNF_Pos				3		// Digital Noise Filter, pulse narrower than DNF+1 are considered glitch
#define I2C_CR_DNF_Msk				(0x0F << I2C_CR_DNF_Pos)

#define I2C_SR_BUSY_Pos				0
#define I2C_SR_BUSY_Msk				(0x01 << I2C_SR_BUSY_Pos)
#define I2C_SR_SCL_Pos				1		// SCL Line Level
#define I2C_SR_SCL_Msk				(0x01 << I2C_SR_SCL_Pos)
#define I2C_SR_SDA_Pos				2		// SDA Line Level
#define I2C_SR_SDA_Msk				(0x01 << I2C_SR_SDA_Pos)

#define I2C_TR_TXACK_Pos			0		// when as receiver, ACK level to send
#define I2C_TR_TXACK_Msk			(0x01 << I2C_TR_TXACK_Pos)
#define I2C_TR_RXACK_Pos			1		// when as tramsmiter, ACK value received
#define I2C_TR_RXACK_Msk			(0x01 << I2C_TR_RXACK_Pos)
#define I2C_TR_TXCLR_Pos			2		// TX Data Clear, auto returning to zero
#define I2C_TR_TXCLR_Msk			(0x01 << I2C_TR_TXCLR_Pos)
#define I2C_TR_SLVACT_Pos			8		// Slave Active, set when selected by host
#define I2C_TR_SLVACT_Msk			(0x01 << I2C_TR_SLVACT_Pos)
#define I2C_TR_SLVRD_Pos			9		// Slave Read mode, set when receive read request
#define I2C_TR_SLVRD_Msk			(0x01 << I2C_TR_SLVRD_Pos)
#define I2C_TR_SLVWR_Pos			10		// Slave Write mode, set when receive write request
#define I2C_TR_SLVWR_Msk			(0x01 << I2C_TR_SLVWR_Pos)
#define I2C_TR_SLVSTR_Pos			11		// Slave clock stretching
#define I2C_TR_SLVSTR_Msk			(0x01 << I2C_TR_SLVSTR_Pos)
#define I2C_TR_SLVRDS_Pos			12		// Slave RXDATA Status, 0 empty, 1 receive address, 2 receive data, 3 receive Master Code
#define I2C_TR_SLVRDS_Msk			(0x03 << I2C_TR_SLVRDS_Pos)

#define I2C_IF_TXE_Pos				0		// TX Empty, clear by write TXDATA
#define I2C_IF_TXE_Msk				(0x01 << I2C_IF_TXE_Pos)
#define I2C_IF_RXNE_Pos				1		// RX Not Empty, clear by read RXDATA
#define I2C_IF_RXNE_Msk				(0x01 << I2C_IF_RXNE_Pos)
#define I2C_IF_RXOV_Pos				2		// RX Overflow, clear by read
#define I2C_IF_RXOV_Msk				(0x01 << I2C_IF_RXOV_Pos)
#define I2C_IF_TXDONE_Pos			3		// TX Done, write 1 to clear
#define I2C_IF_TXDONE_Msk			(0x01 << I2C_IF_TXDONE_Pos)
#define I2C_IF_RXDONE_Pos			4		// RX Done, write 1 to clear
#define I2C_IF_RXDONE_Msk			(0x01 << I2C_IF_RXDONE_Pos)
#define I2C_IF_RXSTA_Pos			8		// slave received start bit, write 1 to clear
#define I2C_IF_RXSTA_Msk			(0x01 << I2C_IF_RXSTA_Pos)
#define I2C_IF_RXSTO_Pos			9		// slave received stop bit, write 1 to clear
#define I2C_IF_RXSTO_Msk			(0x01 << I2C_IF_RXSTO_Pos)
#define I2C_IF_AL_Pos				16		// host lost arbitration, write 1 to clear
#define I2C_IF_AL_Msk				(0x01 << I2C_IF_AL_Pos)
#define I2C_IF_MLTO_Pos				17		// Master SCL Low Timeout, write 1 to clear
#define I2C_IF_MLTO_Msk				(0x01 << I2C_IF_MLTO_Pos)

#define I2C_IE_TXE_Pos				0
#define I2C_IE_TXE_Msk				(0x01 << I2C_IE_TXE_Pos)
#define I2C_IE_RXNE_Pos				1
#define I2C_IE_RXNE_Msk				(0x01 << I2C_IE_RXNE_Pos)
#define I2C_IE_RXOV_Pos				2
#define I2C_IE_RXOV_Msk				(0x01 << I2C_IE_RXOV_Pos)
#define I2C_IE_TXDONE_Pos			3
#define I2C_IE_TXDONE_Msk			(0x01 << I2C_IE_TXDONE_Pos)
#define I2C_IE_RXDONE_Pos			4
#define I2C_IE_RXDONE_Msk			(0x01 << I2C_IE_RXDONE_Pos)
#define I2C_IE_RXSTA_Pos			8
#define I2C_IE_RXSTA_Msk			(0x01 << I2C_IE_RXSTA_Pos)
#define I2C_IE_RXSTO_Pos			9
#define I2C_IE_RXSTO_Msk			(0x01 << I2C_IE_RXSTO_Pos)
#define I2C_IE_AL_Pos				16
#define I2C_IE_AL_Msk				(0x01 << I2C_IE_AL_Pos)
#define I2C_IE_MLTO_Pos				17
#define I2C_IE_MLTO_Msk				(0x01 << I2C_IE_MLTO_Pos)

#define I2C_MCR_STA_Pos				0		// Writing 1 generate start bit and automatically clear to zero after completion
#define I2C_MCR_STA_Msk				(0x01 << I2C_MCR_STA_Pos)
#define I2C_MCR_RD_Pos				1
#define I2C_MCR_RD_Msk				(0x01 << I2C_MCR_RD_Pos)
#define I2C_MCR_WR_Pos				2
#define I2C_MCR_WR_Msk				(0x01 << I2C_MCR_WR_Pos)
#define I2C_MCR_STO_Pos				3		// Writing 1 generate stop bit and automatically clear to zero after completion
#define I2C_MCR_STO_Msk				(0x01 << I2C_MCR_STO_Pos)

#define I2C_CLK_SCLL_Pos			0		// SCL Low Time
#define I2C_CLK_SCLL_Msk			(0xFF << I2C_CLK_SCLL_Pos)
#define I2C_CLK_SCLH_Pos			8		// SCL High Time
#define I2C_CLK_SCLH_Msk			(0xFF << I2C_CLK_SCLH_Pos)
#define I2C_CLK_DIV_Pos				16
#define I2C_CLK_DIV_Msk				(0xFF << I2C_CLK_DIV_Pos)
#define I2C_CLK_SDAH_Pos			24		// SDA Hold Time
#define I2C_CLK_SDAH_Msk			(0x0F << I2C_CLK_SDAH_Pos)

