ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
typedef struct {    
	__IO uint32_t IF;						// Interrupt Flag
    
	__IO uint32_t IFC;						// Interrupt Flag Clear
    	
		 uint32_t RESERVED[2];
		
	struct {
		__IO uint32_t MUX;
		
		__IO uint32_t CR;
		
		__IO uint32_t NDT;					// Number of data to transfer
		
		__IO uint32_t PAR;					// Peripheral address register
		
		__IO uint32_t MAR;					// Memory address register
		
			 uint32_t RESERVED[3];
	} CH[2];
} DMA_TypeDef;


#define DMA_IF_GLB0_Pos				0		// Channel 0 global interrupt
#define DMA_IF_GLB0_Msk				(0x01 << DMA_IF_GLB0_Pos)
#define DMA_IF_DONE0_Pos			1		// Channel 0 transfer done
#define DMA_IF_DONE0_Msk			(0x01 << DMA_IF_DONE0_Pos)
#define DMA_IF_HALF0_Pos			2		// Channel 0 half transfer
#define DMA_IF_HALF0_Msk			(0x01 << DMA_IF_HALF0_Pos)
#define DMA_IF_ERR0_Pos				3		// Channel 0 transfer error
#define DMA_IF_ERR0_Msk				(0x01 << DMA_IF_ERR0_Pos)
#define DMA_IF_GLB1_Pos				4
#define DMA_IF_GLB1_Msk				(0x01 << DMA_IF_GLB1_Pos)
#define DMA_IF_DONE1_Pos			5
#define DMA_IF_DONE1_Msk			(0x01 << DMA_IF_DONE1_Pos)
#define DMA_IF_HALF1_Pos			6
#define DMA_IF_HALF1_Msk			(0x01 << DMA_IF_HALF1_Pos)
#define DMA_IF_ERR1_Pos				7
#define DMA_IF_ERR1_Msk				(0x01 << DMA_IF_ERR1_Pos)
#define DMA_IF_GLB2_Pos				8
#define DMA_IF_GLB2_Msk				(0x01 << DMA_IF_GLB2_Pos)
#define DMA_IF_DONE2_Pos			9
#define DMA_IF_DONE2_Msk			(0x01 << DMA_IF_DONE2_Pos)
#define DMA_IF_HALF2_Pos			10
#define DMA_IF_HALF2_Msk			(0x01 << DMA_IF_HALF2_Pos)
#define DMA_IF_ERR2_Pos				11
#define DMA_IF_ERR2_Msk				(0x01 << DMA_IF_ERR2_Pos)
#define DMA_IF_GLB3_Pos				12
#define DMA_IF_GLB3_Msk				(0x01 << DMA_IF_GLB3_Pos)
#define DMA_IF_DONE3_Pos			13
#define DMA_IF_DONE3_Msk			(0x01 << DMA_IF_DONE3_Pos)
#define DMA_IF_HALF3_Pos			14
#define DMA_IF_HALF3_Msk			(0x01 << DMA_IF_HALF3_Pos)
#define DMA_IF_ERR3_Pos				15
#define DMA_IF_ERR3_Msk				(0x01 << DMA_IF_ERR3_Pos)

#define DMA_IFC_GLB0_Pos			0
#define DMA_IFC_GLB0_Msk			(0x01 << DMA_IFC_GLB0_Pos)
#define DMA_IFC_DONE0_Pos			1
#define DMA_IFC_DONE0_Msk			(0x01 << DMA_IFC_DONE0_Pos)
#define DMA_IFC_HALF0_Pos			2
#define DMA_IFC_HALF0_Msk			(0x01 << DMA_IFC_HALF0_Pos)
#define DMA_IFC_ERR0_Pos			3
#define DMA_IFC_ERR0_Msk			(0x01 << DMA_IFC_ERR0_Pos)
#define DMA_IFC_GLB1_Pos			4
#define DMA_IFC_GLB1_Msk			(0x01 << DMA_IFC_GLB1_Pos)
#define DMA_IFC_DONE1_Pos			5
#define DMA_IFC_DONE1_Msk			(0x01 << DMA_IFC_DONE1_Pos)
#define DMA_IFC_HALF1_Pos			6
#define DMA_IFC_HALF1_Msk			(0x01 << DMA_IFC_HALF1_Pos)
#define DMA_IFC_ERR1_Pos			7
#define DMA_IFC_ERR1_Msk			(0x01 << DMA_IFC_ERR1_Pos)
#define DMA_IFC_GLB2_Pos			8
#define DMA_IFC_GLB2_Msk			(0x01 << DMA_IFC_GLB2_Pos)
#define DMA_IFC_DONE2_Pos			9
#define DMA_IFC_DONE2_Msk			(0x01 << DMA_IFC_DONE2_Pos)
#define DMA_IFC_HALF2_Pos			10
#define DMA_IFC_HALF2_Msk			(0x01 << DMA_IFC_HALF2_Pos)
#define DMA_IFC_ERR2_Pos			11
#define DMA_IFC_ERR2_Msk			(0x01 << DMA_IFC_ERR2_Pos)
#define DMA_IFC_GLB3_Pos			12
#define DMA_IFC_GLB3_Msk			(0x01 << DMA_IFC_GLB3_Pos)
#define DMA_IFC_DONE3_Pos			13
#define DMA_IFC_DONE3_Msk			(0x01 << DMA_IFC_DONE3_Pos)
#define DMA_IFC_HALF3_Pos			14
#define DMA_IFC_HALF3_Msk			(0x01 << DMA_IFC_HALF3_Pos)
#define DMA_IFC_ERR3_Pos			15
#define DMA_IFC_ERR3_Msk			(0x01 << DMA_IFC_ERR3_Pos)

#define DMA_MUX_MRDHSSIG_Pos		0		// memory read  handshake signal
#define DMA_MUX_MRDHSSIG_Msk		(0x03 << DMA_MUX_MRDHSSIG_Pos)
#define DMA_MUX_MRDHSEN_Pos			3		// memory read  handshake enable
#define DMA_MUX_MRDHSEN_Msk			(0x01 << DMA_MUX_MRDHSEN_Pos)
#define DMA_MUX_MWRHSSIG_Pos		4		// memory write handshake signal
#define DMA_MUX_MWRHSSIG_Msk		(0x03 << DMA_MUX_MWRHSSIG_Pos)
#define DMA_MUX_MWRHSEN_Pos			7		// memory write handshake enable
#define DMA_MUX_MWRHSEN_Msk			(0x01 << DMA_MUX_MWRHSEN_Pos)
#define DMA_MUX_EXTHSSIG_Pos		8		// external handshake signal
#define DMA_MUX_EXTHSSIG_Msk		(0x07 << DMA_MUX_EXTHSSIG_Pos)
#define DMA_MUX_EXTHSEN_Pos			11
#define DMA_MUX_EXTHSEN_Msk			(0x01 << DMA_MUX_EXTHSEN_Pos)

#define DMA_CR_EN_Pos				0
#define DMA_CR_EN_Msk				(0x01 << DMA_CR_EN_Pos)
#define DMA_CR_DONEIE_Pos			1
#define DMA_CR_DONEIE_Msk			(0x01 << DMA_CR_DONEIE_Pos)
#define DMA_CR_HALFIE_Pos			2
#define DMA_CR_HALFIE_Msk			(0x01 << DMA_CR_HALFIE_Pos)
#define DMA_CR_ERRIE_Pos			3
#define DMA_CR_ERRIE_Msk			(0x01 << DMA_CR_ERRIE_Pos)
#define DMA_CR_DIR_Pos				4
#define DMA_CR_DIR_Msk				(0x01 << DMA_CR_DIR_Pos)
#define DMA_CR_CIRC_Pos				5
#define DMA_CR_CIRC_Msk				(0x01 << DMA_CR_CIRC_Pos)
#define DMA_CR_PINC_Pos				6
#define DMA_CR_PINC_Msk				(0x01 << DMA_CR_PINC_Pos)
#define DMA_CR_MINC_Pos				7
#define DMA_CR_MINC_Msk				(0x01 << DMA_CR_MINC_Pos)
#define DMA_CR_PSIZ_Pos				8
#define DMA_CR_PSIZ_Msk				(0x03 << DMA_CR_PSIZ_Pos)
#define DMA_CR_MSIZ_Pos				10
#define DMA_CR_MSIZ_Msk				(0x03 << DMA_CR_MSIZ_Pos)
#define DMA_CR_PL_Pos				12
#define DMA_CR_PL_Msk				(0x0F << DMA_CR_PL_Pos)
#define DMA_CR_MEM2MEM_Pos			16
#define DMA_CR_MEM2MEM_Msk			(0x01 << DMA_CR_MEM2MEM_Pos)

#define DMA_NDT_LEN_Pos				0		// When the channel is closed, write the number of data to be transferred; 
											// After the channel is enabled, indicates the number of data remaining to be transferred
#define DMA_NDT_LEN_Msk				(0xFFFFFF << DMA_NDT_LEN_Pos)
#define DMA_NDT_HALF_Pos			24		// After the specified number of data is transmitted, set the DMA->IF.HALF interrupt flag bit
											// 1 1/8 * LEN, 2 2/8 * LEN, ...
#define DMA_NDT_HALF_Msk			(0x07 << DMA_NDT_HALF_Pos)




typedef struct {
	__IO uint32_t IF;
	
	__IO uint32_t IE;
	
	__IO uint32_t CR;
	
	__IO uint32_t SRC;
	
	__IO uint32_t DES;
	
	__IO uint32_t LEN;
	
	__IO uint32_t SR;
} RDMA_TypeDef;


#define RDMA_IF_DONE_Pos			0		// transfer done
#define RDMA_IF_DONE_Msk			(0x01 << RDMA_IF_DONE_Pos)
#define RDMA_IF_PART_Pos			1		// transfer part done
#define RDMA_IF_PART_Msk			(0x01 << RDMA_IF_PART_Pos)
#define RDMA_IF_ERROR_Pos			2		// transfer configure error
#define RDMA_IF_ERROR_Msk			(0x01 << RDMA_IF_ERROR_Pos)

#define RDMA_IE_DONE_Pos			0
#define RDMA_IE_DONE_Msk			(0x01 << RDMA_IE_DONE_Pos)
#define RDMA_IE_PART_Pos			1
#define RDMA_IE_PART_Msk			(0x01 << RDMA_IE_PART_Pos)
#define RDMA_IE_ERROR_Pos			2
#define RDMA_IE_ERROR_Msk			(0x01 << RDMA_IE_ERROR_Pos)

#define RDMA_CR_START_Pos			0		// clear when transfer done or error
#define RDMA_CR_START_Msk			(0x01 << RDMA_CR_START_Pos)
#define RDMA_CR_BURST_Pos			1		// 0 Incr16, 1 Incr8, 2 Incr4, 3 Single
#define RDMA_CR_BURST_Msk			(0x03 << RDMA_CR_BURST_Pos)
#define RDMA_CR_RSIZE_Pos			3		// Read size: 0 Byte, 1 Half Word, 2 Wrod
#define RDMA_CR_RSIZE_Msk			(0x03 << RDMA_CR_RSIZE_Pos)
#define RDMA_CR_WSIZE_Pos			5		// Write size: 0 Byte, 1 Half Word, 2 Wrod
#define RDMA_CR_WSIZE_Msk			(0x03 << RDMA_CR_WSIZE_Pos)
#define RDMA_CR_BLKSZ_Pos			7		// Block Size, RDMA can insert WAIT clock cycles for each BLKSZ word transported, 0 16   1 32   2 64   3 128
#define RDMA_CR_BLKSZ_Msk			(0x03 << RDMA_CR_BLKSZ_Pos)
#define RDMA_CR_RHSEN_Pos			9		// Read handshake enable, source address fix
#define RDMA_CR_RHSEN_Msk			(0x01 << RDMA_CR_RHSEN_Pos)
#define RDMA_CR_WHSEN_Pos			10		// Write handshake enable, destination address fix
#define RDMA_CR_WHSEN_Msk			(0x01 << RDMA_CR_WHSEN_Pos)
#define RDMA_CR_HSSEL_Pos			11		// Handshake signal select, 0 QSPI0, 1 QSPI1
#define RDMA_CR_HSSEL_Msk			(0x01 << RDMA_CR_HSSEL_Pos)
#define RDMA_CR_WAIT_Pos			16		// data block transfer interval in unit of HCLK period
#define RDMA_CR_WAIT_Msk			(0xFFFFu<<RDMA_CR_WAIT_Pos)

