ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
	__IO uint32_t RSTTR;					// reset timing register
	
	__IO uint32_t SLPTR;					// sleep timing register
	
	__IO uint32_t PWDNTR;					// power-down timing register
	
	__IO uint32_t MR0;						// Configuration Register 0 what will be written to PSRAM
	
	__IO uint32_t MR4;						// Configuration Register 1 what will be written to PSRAM
	
	__IO uint32_t MR8;
	
	__IO uint32_t TR1US;					// the number of clock cycles in 1uS at the current frequency
} PSRAMC_TypeDef;


#define PSRAMC_CSR_ROWSZ_Pos		0		// row size, 0 512-byte, 1 1kbyte, 2 2kbyte, 3 4kbyte
#define PSRAMC_CSR_ROWSZ_Msk		(0x03 << PSRAMC_CSR_ROWSZ_Pos)
#define PSRAMC_CSR_MODE_Pos			2		// 0 default mode, 2 extended mode, 3 standard mode. TR.CEM, SLPTR.CSHS unit is HCLK (when MODE == 0) or us (when MODE == 2/3)
#define PSRAMC_CSR_MODE_Msk			(0x03 << PSRAMC_CSR_MODE_Pos)
#define PSRAMC_CSR_RESET_Pos		16
#define PSRAMC_CSR_RESET_Msk		(0x01 << PSRAMC_CSR_RESET_Pos)
#define PSRAMC_CSR_IRREN_Pos		18		// IR read enable
#define PSRAMC_CSR_IRREN_Msk		(0x01 << PSRAMC_CSR_IRREN_Pos)
#define PSRAMC_CSR_WRBUSY_Pos		20		// write busy
#define PSRAMC_CSR_WRBUSY_Msk		(0x01 << PSRAMC_CSR_WRBUSY_Pos)
#define PSRAMC_CSR_ISPWDN_Pos		21		// is in power-down?
#define PSRAMC_CSR_ISPWDN_Msk		(0x01 << PSRAMC_CSR_ISPWDN_Pos)
#define PSRAMC_CSR_ISSLEEP_Pos		22		// is in sleep?
#define PSRAMC_CSR_ISSLEEP_Msk		(0x01 << PSRAMC_CSR_ISSLEEP_Pos)
#define PSRAMC_CSR_INITDONE_Pos		23		// init done?
#define PSRAMC_CSR_INITDONE_Msk		(0x01 << PSRAMC_CSR_INITDONE_Pos)
#define PSRAMC_CSR_CKEDGE_Pos		24
#define PSRAMC_CSR_CKEDGE_Msk		(0x01 << PSRAMC_CSR_CKEDGE_Pos)
#define PSRAMC_CSR_RDBUSY_Pos		25		// read busy
#define PSRAMC_CSR_RDBUSY_Msk		(0x01 << PSRAMC_CSR_RDBUSY_Pos)
#define PSRAMC_CSR_DQSDLY_Pos		26		// After Cmd/Addr sent, how many cycles waiting before detect DQS signal
#define PSRAMC_CSR_DQSDLY_Msk		(0x07 << PSRAMC_CSR_DQSDLY_Pos)

#define PSRAMC_TR_CPH_Pos			8		// tCPH, CE# HIGH between subsequent burst operations in tHCLK
#define PSRAMC_TR_CPH_Msk			(0xFF << PSRAMC_TR_CPH_Pos)
#define PSRAMC_TR_CEM_Pos			16		// tCEM, CE# low pulse width in tHCLK
#define PSRAMC_TR_CEM_Msk			(0xFF << PSRAMC_TR_CEM_Pos)
#define PSRAMC_TR_RC_Pos			24		// tRC, Write/Read Cycle in tHCLK
#define PSRAMC_TR_RC_Msk			(0xFFu<< PSRAMC_TR_RC_Pos)

#define PSRAMC_RSTTR_RPH_Pos		0		// tRPH, RESET# Low to CS# Low time in us
#define PSRAMC_RSTTR_RPH_Msk		(0xFFFF<< PSRAMC_RSTTR_RPH_Pos)
#define PSRAMC_RSTTR_RST_Pos		16		// tRST, RESET# High to CS# Low time in us
#define PSRAMC_RSTTR_RST_Msk		(0xFF << PSRAMC_RSTTR_RST_Pos)
#define PSRAMC_RSTTR_RP_Pos			24		// tRP, RESET# low pulse width in us
#define PSRAMC_RSTTR_RP_Msk			(0xFF << PSRAMC_RSTTR_RP_Pos)

#define PSRAMC_SLPTR_EXTHS_Pos		0		// tEXTHS, CS# Exit Hybrid Sleep to Standby wakeup time in us
#define PSRAMC_SLPTR_EXTHS_Msk		(0xFFFF<< PSRAMC_SLPTR_EXTHS_Pos)
#define PSRAMC_SLPTR_CSHS_Pos		16		// tCSHS, CS# Pulse Width to Exit Hybrid Sleep in tHCLK
#define PSRAMC_SLPTR_CSHS_Msk		(0xFF << PSRAMC_SLPTR_CSHS_Pos)
#define PSRAMC_SLPTR_HSIN_Pos		24		// tHSIN, Hybrid Sleep CR1[5]=1 register write to Hybrid Sleep power level time in us
#define PSRAMC_SLPTR_HSIN_Msk		(0xFFu<< PSRAMC_SLPTR_HSIN_Pos)

#define PSRAMC_PWDNTR_EXTDPD_Pos	0		// tEXTDPD, CS# Exit Deep Power Down to Standby wakeup time in us
#define PSRAMC_PWDNTR_EXTDPD_Msk	(0xFF << PSRAMC_PWDNTR_EXTDPD_Pos)
#define PSRAMC_PWDNTR_CSDPD_Pos		8		// tCSDPD, CS# Pulse Width to Exit Deep Power Down in tHCLK
#define PSRAMC_PWDNTR_CSDPD_Msk		(0xFF << PSRAMC_PWDNTR_CSDPD_Pos)
#define PSRAMC_PWDNTR_DPDIN_Pos		16		// tDPDIN, Deep Power Down CR0[15]=0 register write to DPD power level in us
#define PSRAMC_PWDNTR_DPDIN_Msk		(0xFFFFu<< PSRAMC_PWDNTR_DPDIN_Pos)

#define PSRAMC_MR0_DRVST_Pos		0		// 驱动强度
#define PSRAMC_MR0_DRVST_Msk		(0x03 << PSRAMC_MR0_DRVST_Pos)
#define PSRAMC_MR0_RDLatency_Pos	2
#define PSRAMC_MR0_RDLatency_Msk	(0x07 << PSRAMC_MR0_RDLatency_Pos)
#define PSRAMC_MR0_FixLatency_Pos	5		// Fixed Latency Enable, 0 Variable Latency depending on RWDS during CA cycles, 1 Fixed 2 times Initial Latency
#define PSRAMC_MR0_FixLatency_Msk	(0x01 << PSRAMC_MR0_FixLatency_Pos)

#define PSRAMC_MR4_PartialRef_Pos	0		// Partial Array Refresh, 0 Full Array
#define PSRAMC_MR4_PartialRef_Msk	(0x07 << PSRAMC_MR4_PartialRef_Pos)
#define PSRAMC_MR4_FastRef_Pos		3		// 0 快速刷新， 1 温度允许时启动慢速刷新
#define PSRAMC_MR4_FastRef_Msk		(0x01 << PSRAMC_MR4_FastRef_Pos)
#define PSRAMC_MR4_WRLatency_Pos	5
#define PSRAMC_MR4_WRLatency_Msk	(0x07 << PSRAMC_MR4_WRLatency_Pos)

#define PSRAMC_MR8_BurstType_Pos	0		// Burst Type
#define PSRAMC_MR8_BurstType_Msk	(0x07 << PSRAMC_MR8_BurstType_Pos)
#define PSRAMC_MR8_BUS16b_Pos		6		// Bus Width
#define PSRAMC_MR8_BUS16b_Msk		(0x01 << PSRAMC_MR8_BUS16b_Pos)

#endif




typedef struct {
	__IO uint32_t IF;
	
	__IO uint32_t IE;
	
	__IO uint32_t OUTCR;
    
    __IO uint32_t START;
    
    __IO uint32_t RESERVED;
    
    __IO uint32_t CR;
	    
    __IO uint32_t CRH0;
	
	__IO uint32_t CRH1;
		
	__IO uint32_t CRV0;
	
	__IO uint32_t CRV1;
	
	__IO uint32_t BGC;						// Background color
	
		 uint32_t RESERVED2[5];
	
	struct {
		__IO uint32_t LCR;					// Layer Control Register
		
		__IO uint32_t WHP;					// Window Horizon Position
		
		__IO uint32_t WVP;					// Window Vertical Position
		
		__IO uint32_t ADDR;					// display data Address
		
		__IO uint32_t LLEN;					// display data Line Length
		
		__IO uint32_t CK;					// Color Key
		
			 uint32_t RESERVED3[10];
	} L[1];									// Layer
	
		 uint32_t RESERVED4[32];
	
	__IO uint32_t MPUCR;
	
	union {
		__IO uint8_t  MPUIRB;
		
		__IO uint16_t MPUIRH;
		
		__IO uint32_t RESERVED5;
	};
	
	union {
		__IO uint8_t  MPUDRB;
		
		__IO uint16_t MPUDRH;
		
		__IO uint32_t RESERVED6;
	};
} LCD_TypeDef;


#define LCD_IF_DONE_Pos				0		// frame transfer done interrupt flag, write 1 to clear
#define LCD_IF_DONE_Msk				(0x01 << LCD_IF_DONE_Pos)
#define LCD_IF_PART_Pos				1		// partial frame transfer done interrupt flag, write 1 to clear
#define LCD_IF_PART_Msk				(0x01 << LCD_IF_PART_Pos)

#define LCD_IE_DONE_Pos				0
#define LCD_IE_DONE_Msk				(0x01 << LCD_IE_DONE_Pos)
#define LCD_IE_PART_Pos				1
#define LCD_IE_PART_Msk				(0x01 << LCD_IE_PART_Pos)

