ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define LCD_OUTCR_BYTE0_Pos			0		// LCD_DATA[ 7: 0] output color component: 0 Blue   1 Green   2 Red
#define LCD_OUTCR_BYTE0_Msk			(0x03 << LCD_OUTCR_BYTE0_Pos)
#define LCD_OUTCR_BYTE0INV_Pos		2		// LCD_DATA[ 7: 0] output bit order inverse
#define LCD_OUTCR_BYTE0INV_Msk		(0x01 << LCD_OUTCR_BYTE0INV_Pos)
#define LCD_OUTCR_BYTE1_Pos			4		// LCD_DATA[15: 8] output color component: 0 Green   1 Red   2 Blue
#define LCD_OUTCR_BYTE1_Msk			(0x03 << LCD_OUTCR_BYTE1_Pos)
#define LCD_OUTCR_BYTE1INV_Pos		6		// LCD_DATA[15: 8] output bit order inverse
#define LCD_OUTCR_BYTE1INV_Msk		(0x01 << LCD_OUTCR_BYTE1INV_Pos)
#define LCD_OUTCR_BYTE2_Pos			8		// LCD_DATA[23:16] output color component: 0 Red   1 Blue   2 Green
#define LCD_OUTCR_BYTE2_Msk			(0x03 << LCD_OUTCR_BYTE2_Pos)
#define LCD_OUTCR_BYTE2INV_Pos		10		// LCD_DATA[23:16] output bit order inverse
#define LCD_OUTCR_BYTE2INV_Msk		(0x01 << LCD_OUTCR_BYTE2INV_Pos)

#define LCD_START_GO_Pos			1		// Write 1 Starts data transmission and automatically clears after transmission ends
#define LCD_START_GO_Msk			(0x01 << LCD_START_GO_Pos)

#define LCD_CR_CLKDIV_Pos			0      	// clock divider, 0 div2, 1 div3, ...
#define LCD_CR_CLKDIV_Msk			(0x3F << LCD_CR_CLKDIV_Pos)
#define LCD_CR_CLKINV_Pos			6      	// DOTCLK invert, used for LCD that samples at falling edge of DOTCLK
#define LCD_CR_CLKINV_Msk			(0x01 << LCD_CR_CLKINV_Pos)
#define LCD_CR_CLKALW_Pos			7		// DOTCLK Always, 0 DOTCLK keep at high level when idle
#define LCD_CR_CLKALW_Msk			(0x01 << LCD_CR_CLKALW_Pos)
#define LCD_CR_BURSTLEN_Pos			8		// Burst Length, 0 Single, 1 Burst INCR4, 2 Burst INCR8, 3 Burst INCR16
#define LCD_CR_BURSTLEN_Msk			(0x03 << LCD_CR_BURSTLEN_Pos)
#define LCD_CR_PARTSIZE_Pos			11		// size used to generate partial frame interrupt, 0 no partial frame interrupt, 1 1/4 frame, 2 2/4 frame, 3 3/4 frame
#define LCD_CR_PARTSIZE_Msk			(0x03 << LCD_CR_PARTSIZE_Pos)
#define LCD_CR_AUTORESTA_Pos		13		// Auto Restart
#define LCD_CR_AUTORESTA_Msk		(0x01 << LCD_CR_AUTORESTA_Pos)
#define LCD_CR_IMMRELOAD_Pos		14		// Immediate Reload, Immediately loads the value of the layer configuration register into the layer working register
#define LCD_CR_IMMRELOAD_Msk		(0x01 << LCD_CR_IMMRELOAD_Pos)
#define LCD_CR_VBPRELOAD_Pos		15		// VBP Period Relaod
#define LCD_CR_VBPRELOAD_Msk		(0x01 << LCD_CR_VBPRELOAD_Pos)
#define LCD_CR_FORMAT_Pos			16		// 0 RGB565, 1 RGB888
#define LCD_CR_FORMAT_Msk			(0x01 << LCD_CR_FORMAT_Pos)
#define LCD_CR_MODE_Pos				17		// 0 RGB, 1 serial RGB, 2 16-bit MPU, 3 8-bit MPU
#define LCD_CR_MODE_Msk				(0x03 << LCD_CR_MODE_Pos)
#define LCD_CR_VSYNCINV_Pos			19		// 1 VSYNC invert
#define LCD_CR_VSYNCINV_Msk			(0x01 << LCD_CR_VSYNCINV_Pos)
#define LCD_CR_HSYNCINV_Pos			20		// 1 HSYNC invert
#define LCD_CR_HSYNCINV_Msk			(0x01 << LCD_CR_HSYNCINV_Pos)
#define LCD_CR_VS2HS_Pos			22		// 1 VSYNC and HSYNC valid at same PIXCLK edge, 0 VSYNC valid one PIXCLK earlier than HSYNC
#define LCD_CR_VS2HS_Msk			(0x01 << LCD_CR_VS2HS_Pos)
#define LCD_CR_MPU8MSB_Pos			23		// when 8-bit MPU mode, for 16-bit data access: 0 LSB, 1 MSB
#define LCD_CR_MPU8MSB_Msk			(0x01 << LCD_CR_MPU8MSB_Pos)
#define LCD_CR_MPUDMAMSB_Pos		24		// when MPU DMA mode, 0 low half word first, 1 high half word first
#define LCD_CR_MPUDMAMSB_Msk		(0x01 << LCD_CR_MPUDMAMSB_Pos)
#define LCD_CR_MPU8PIN_Pos			25		// when 8-bit MPU mode, 0 use LCD_B3-7 and LCD_G2-4 pin, 1 use LCD_G5-7 and LCD_R3-7 pin
#define LCD_CR_MPU8PIN_Msk			(0x01 << LCD_CR_MPU8PIN_Pos)

#define LCD_CRH0_HSW_Pos			0		// Hsync Width, Output HSYNC low for how many DOTCLK cycles. 0 indicates 1 cycle
#define LCD_CRH0_HSW_Msk			(0x1FF<< LCD_CRH0_HSW_Pos)
#define LCD_CRH0_HBP_Pos			10		// 0 indicates one DOTCLK period
#define LCD_CRH0_HBP_Msk			(0x1FF<< LCD_CRH0_HBP_Pos)
#define LCD_CRH0_HFP_Pos			20		// 0 indicates one DOTCLK period
#define LCD_CRH0_HFP_Msk			(0x1FF<< LCD_CRH0_HFP_Pos)

#define LCD_CRH1_PIX_Pos			0		// number of horizontal pixels. 0 indicates 1 and the maximum value is 8191
#define LCD_CRH1_PIX_Msk			(0x1FFF<< LCD_CRH1_PIX_Pos)

#define LCD_CRV0_VSW_Pos			0		//Vsync Width, Output VSYNC low level for how many line cycles, 0 indicates 1 cycle
#define LCD_CRV0_VSW_Msk			(0x1FF<< LCD_CRV0_VSW_Pos)
#define LCD_CRV0_VBP_Pos			10		// 0 indicates 1 horizontal row cycle
#define LCD_CRV0_VBP_Msk			(0x1FF<< LCD_CRV0_VBP_Pos)
#define LCD_CRV0_VFP_Pos			20		// 0 indicates 1 horizontal row cycle
#define LCD_CRV0_VFP_Msk			(0x1FF<< LCD_CRV0_VFP_Pos)

#define LCD_CRV1_PIX_Pos			0		// number of vertical pixels. 0 indicates 1, and the maximum value is 8191
#define LCD_CRV1_PIX_Msk			(0x1FFF<< LCD_CRV1_PIX_Pos)

#define LCD_LCR_ALPHA_Pos			0		// Alpha value of this layer
#define LCD_LCR_ALPHA_Msk			(0xFF << LCD_LCR_ALPHA_Pos)
#define LCD_LCR_EN_Pos				8		// Layer Enable
#define LCD_LCR_EN_Msk				(0x01 << LCD_LCR_EN_Pos)
#define LCD_LCR_CKEN_Pos			9		// Layer Color Key Enable
#define LCD_LCR_CKEN_Msk			(0x01 << LCD_LCR_CKEN_Pos)

#define LCD_WHP_STA_Pos				0		// Layer Window Horizontal start point
#define LCD_WHP_STA_Msk				(0x1FFF<< LCD_WHP_STA_Pos)
#define LCD_WHP_STP_Pos				16		// Layer Window Horizontal end point
#define LCD_WHP_STP_Msk				(0x1FFF<< LCD_WHP_STP_Pos)

#define LCD_WVP_STA_Pos				0		// Layer Window Vertical start point
#define LCD_WVP_STA_Msk				(0x1FFF<< LCD_WVP_STA_Pos)
#define LCD_WVP_STP_Pos				16		// Layer Window Vertical end point
#define LCD_WVP_STP_Msk				(0x1FFF<< LCD_WVP_STP_Pos)

#define LCD_MPUCR_RCS1_0_Pos		0		// for read, LCD_CS rising edge to falling edge delay
#define LCD_MPUCR_RCS1_0_Msk		(0x1F << LCD_MPUCR_RCS1_0_Pos)
#define LCD_MPUCR_RDHOLD_Pos		5		// LCD_RD Low level holding time
#define LCD_MPUCR_RDHOLD_Msk		(0x1F << LCD_MPUCR_RDHOLD_Pos)
#define LCD_MPUCR_WCS1_0_Pos		10		// for write, LCD_CS rising edge to falling edge delay
#define LCD_MPUCR_WCS1_0_Msk		(0x0F << LCD_MPUCR_WCS1_0_Pos)
#define LCD_MPUCR_WR1CS1_Pos		14		// LCD_WR rising edge to LCD_CS rising edge delay
#define LCD_MPUCR_WR1CS1_Msk		(0x03 << LCD_MPUCR_WR1CS1_Pos)
#define LCD_MPUCR_WRHOLD_Pos		16		// LCD_WR Low level holding time
#define LCD_MPUCR_WRHOLD_Msk		(0x0F << LCD_MPUCR_WRHOLD_Pos)
#define LCD_MPUCR_CS0WR0_Pos		20		// LCD_CS falling edge to LCD_WR falling edge delay
#define LCD_MPUCR_CS0WR0_Msk		(0x03 << LCD_MPUCR_CS0WR0_Pos)




