ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
typedef struct {
	__IO uint32_t IF;
	
	__IO uint32_t IE;
	
	__IO uint32_t CR;
	
		 uint32_t RESERVED;
	
	struct {
		__IO uint32_t MAR;					// Memory Address Register, word alignment
		
		__IO uint32_t OR;					// Offset Register, added at the end of each line to determine the starting address of the next line
		
		__IO uint32_t PFCCR;				// Pixel Format Converter Control Register
		
		__IO uint32_t COLOR;
	} L[3];									// Layer: 0 Foreground, 1 Background, 2 Output
	
	__IO uint32_t NLR;						// Number of Line Register
	
	__IO uint32_t AAR;						// Alpha Address, address for Foreground Layer Alpha
	
	__IO uint32_t ERR;						// Error flag
} DMA2D_TypeDef;


#define DMA2D_IF_DONE_Pos			1		// transfer done, wirte 1 to clear
#define DMA2D_IF_DONE_Msk			(0x01 << DMA2D_IF_DONE_Pos)
#define DMA2D_IF_PART_Pos			2		// GPDMA transfer part done, wirte 1 to clear
#define DMA2D_IF_PART_Msk			(0x01 << DMA2D_IF_PART_Pos)
#define DMA2D_IF_ERROR_Pos			3		// Configration error, wirte 1 to clear
#define DMA2D_IF_ERROR_Msk			(0x01 << DMA2D_IF_ERROR_Pos)

#define DMA2D_IE_DONE_Pos			1
#define DMA2D_IE_DONE_Msk			(0x01 << DMA2D_IE_DONE_Pos)
#define DMA2D_IE_PART_Pos			2
#define DMA2D_IE_PART_Msk			(0x01 << DMA2D_IE_PART_Pos)
#define DMA2D_IE_ERROR_Pos			3
#define DMA2D_IE_ERROR_Msk			(0x01 << DMA2D_IE_ERROR_Pos)

#define DMA2D_CR_START_Pos			0		// start transfer
#define DMA2D_CR_START_Msk			(0x01 << DMA2D_CR_START_Pos)
#define DMA2D_CR_BURST_Pos			3		//0 Incr16   1 Incr8   2 Incr4   3 Single
#define DMA2D_CR_BURST_Msk			(0x03 << DMA2D_CR_BURST_Pos)
#define DMA2D_CR_MODE_Pos			8		// 0 memory to memory, 1 memory to memory and do PFC, 2 memory to memory and do blend, 3 register to memory
#define DMA2D_CR_MODE_Msk			(0x03 << DMA2D_CR_MODE_Pos)
#define DMA2D_CR_AAREN_Pos			10		// 1 Foreground Layer Alpha store at AAR
#define DMA2D_CR_AAREN_Msk			(0x01 << DMA2D_CR_AAREN_Pos)
#define DMA2D_CR_GPDMA_Pos			11		// 1 General Purpose DMA mode
#define DMA2D_CR_GPDMA_Msk			(0x01 << DMA2D_CR_GPDMA_Pos)
#define DMA2D_CR_BLKSZ_Pos			14		// Block Size, DMA2D can insert WAIT clock cycles for each BLKSZ word transported, 0 16   1 32   2 64   3 128
#define DMA2D_CR_BLKSZ_Msk			(0x03 << DMA2D_CR_BLKSZ_Pos)
#define DMA2D_CR_WAIT_Pos			16		// data block transfer interval in unit of HCLK period
#define DMA2D_CR_WAIT_Msk			(0xFFFFu<<DMA2D_CR_WAIT_Pos)

#define DMA2D_PFCCR_CFMT_Pos		0		// Color Format, 0 ARGB8888, 1 RGB8888, 2 RGB565
#define DMA2D_PFCCR_CFMT_Msk		(0x07 << DMA2D_CFMT_FORMAT_Pos)
#define DMA2D_PFCCR_AINV_Pos		3		// Alpha Invert
#define DMA2D_PFCCR_AINV_Msk		(0x01 << DMA2D_PFCCR_AINV_Pos)
#define DMA2D_PFCCR_RBSWAP_Pos		4		// RB Swap, 0 RGB, 1 BGR
#define DMA2D_PFCCR_RBSWAP_Msk		(0x01 << DMA2D_PFCCR_RBSWAP_Pos)
#define DMA2D_PFCCR_AMODE_Pos		8		// Alpha Mode, 0 use the pixel's own Alpha value, 1 use PFCCR.ALPHA, 2 use the product of the pixel's own Alpha value and PFCCR.ALPHA
#define DMA2D_PFCCR_AMODE_Msk		(0x03 << DMA2D_PFCCR_AMODE_Pos)
#define DMA2D_PFCCR_ALPHA_Pos		24
#define DMA2D_PFCCR_ALPHA_Msk		(0xFFu<< DMA2D_PFCCR_ALPHA_Pos)

#define DMA2D_NLR_NLINE_Pos			0		// Number of Line
#define DMA2D_NLR_NLINE_Msk			(0xFFFF<<DMA2D_NLR_NLINE_Pos)
#define DMA2D_NLR_NPIXEL_Pos		16		// Number of Pixel per line
#define DMA2D_NLR_NPIXEL_Msk		(0x3FFF<<DMA2D_NLR_NPIXEL_Pos)

#define DMA2D_ERR_FG_Pos			0		// FG layer address configration error
#define DMA2D_ERR_FG_Msk			(0x01 << DMA2D_ERR_FG_Pos)
#define DMA2D_ERR_BG_Pos			1		// BG layer address configration error
#define DMA2D_ERR_BG_Msk			(0x01 << DMA2D_ERR_BG_Pos)
#define DMA2D_ERR_OUT_Pos			2		// OUT layer address configration error
#define DMA2D_ERR_OUT_Msk			(0x01 << DMA2D_ERR_OUT_Pos)
#define DMA2D_ERR_ALPHA_Pos			3		// ALPHA layer address configration error
#define DMA2D_ERR_ALPHA_Msk			(0x01 << DMA2D_ERR_ALPHA_Pos)




typedef struct {
	__IO uint32_t CFG;						// JPEG DEC configure register
	
	__IO uint32_t CR;						// JPEG DEC control register
	
	__IO uint32_t IR;						// JPEG DEC interrupt register
	
	__IO uint32_t SR;						// JPEG DEC status register
	
	__IO uint32_t IMGSIZ;					// JPEG image size
	
	__IO uint32_t IMGSTR;					// JPEG image size virtual stride
	
	__IO uint32_t CSBASE;					// JPEG code-stream base address
	
	union {
		__IO uint32_t YBASE;				// YUV image Y base address
		
		__IO uint32_t RGBASE;				// RGB image base address
	};
	
	__IO uint32_t UBASE;					// YUV image U base address
	
	__IO uint32_t VBASE;					// YUV image V base address
	
	__IO uint32_t QTBASE;					// JPEG quantization table base address
	
	__IO uint32_t HTBASE;					// JPEG huffman table base address
	
	__IO uint32_t CODLEN;					// JPEG code stream total length in byte
	
		 uint32_t RESERVED[51];
	
	__O  uint32_t QTABLE[3][16];			// Quantization table
	
		 uint32_t RESERVED2[16];
	
	struct {
		__O  uint32_t DC_CODEWORD[6];
		__O  uint32_t DC_CODELEN[2];
		__O  uint32_t DC_CODEVAL[2];
		
		__O  uint32_t AC_CODEWORD[8];
		__O  uint32_t AC_CODEADDR[4];
		__O  uint32_t AC_CODEVAL[41];
		
			 uint32_t RESERVED;
	} HTABLE[2];							// Huffman table
} JPEG_TypeDef;


#define JPEG_CFG_SRCFMT_Pos			0		// JPEG Source Format, 0 YUV420(H2V2), 1 YUV422(H2V1), 2 YUV444(H1V1)
#define JPEG_CFG_SRCFMT_Msk			(0x03 << JPEG_CFG_SRCFMT_Pos)
#define JPEG_CFG_SCANMOD_Pos		2		// JPEG scan mode, 0 interleaved (three components), 1 non-interleaved (single component)
#define JPEG_CFG_SCANMOD_Msk		(0x01 << JPEG_CFG_SCANMOD_Pos)
#define JPEG_CFG_NISCOMP_Pos		3		// Non-Interleaved Scanning Component, 0 component 1, 1 component 2, 2 component 3
#define JPEG_CFG_NISCOMP_Msk		(0x03 << JPEG_CFG_NISCOMP_Pos)
#define JPEG_CFG_HT1COMP_Pos		5		// Huffman Table for Component 1, 0 table 0, 1 table 1
#define JPEG_CFG_HT1COMP_Msk		(0x01 << JPEG_CFG_HT1COMP_Pos)
#define JPEG_CFG_HT2COMP_Pos		6
#define JPEG_CFG_HT2COMP_Msk		(0x01 << JPEG_CFG_HT2COMP_Pos)
#define JPEG_CFG_HT3COMP_Pos		7
#define JPEG_CFG_HT3COMP_Msk		(0x01 << JPEG_CFG_HT3COMP_Pos)
#define JPEG_CFG_QT1COMP_Pos		8		// Quantization Table for Component 1, 0 table 0, 1 table 1, 2 table 2
#define JPEG_CFG_QT1COMP_Msk		(0x03 << JPEG_CFG_QT1COMP_Pos)
#define JPEG_CFG_QT2COMP_Pos		10
#define JPEG_CFG_QT2COMP_Msk		(0x03 << JPEG_CFG_QT2COMP_Pos)
#define JPEG_CFG_QT3COMP_Pos		12
#define JPEG_CFG_QT3COMP_Msk		(0x03 << JPEG_CFG_QT3COMP_Pos)
#define JPEG_CFG_OUTFMT_Pos			14		// Image data output format, 0 YUV planar, 1 YUV semi-planar, 2 XRGB888, 3 RGB888, 4 RGB565
#define JPEG_CFG_OUTFMT_Msk			(0x07 << JPEG_CFG_OUTFMT_Pos)
#define JPEG_CFG_YUV2RGB_Pos		17		// YUV2RGB translation, 0 Disable, 1 Enable
#define JPEG_CFG_YUV2RGB_Msk		(0x01 << JPEG_CFG_YUV2RGB_Pos)
#define JPEG_CFG_UVSWAP_Pos			18		// UV output swap, 0 YUV, 1 YVU
#define JPEG_CFG_UVSWAP_Msk			(0x01 << JPEG_CFG_UVSWAP_Pos)
#define JPEG_CFG_RBSWAP_Pos			19		// RB output swap, 0 RGB, 1 BGR
#define JPEG_CFG_RBSWAP_Msk			(0x01 << JPEG_CFG_RBSWAP_Pos)
#define JPEG_CFG_EDSWAP_Pos			20		// endian swap, 0 XRGB, 1 BGRX
#define JPEG_CFG_EDSWAP_Msk			(0x01 << JPEG_CFG_EDSWAP_Pos)
#define JPEG_CFG_565DITH_Pos		21		// RGB565 dithering, 0 Disable, 1 Enable
#define JPEG_CFG_565DITH_Msk		(0x01 << JPEG_CFG_565DITH_Pos)

