ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define JPEG_CR_START_Pos			0		// JPEG DEC frame start, automatically clear when done
#define JPEG_CR_START_Msk			(0x01 << JPEG_CR_START_Pos)
#define JPEG_CR_RESTART_Pos			1		// Decoder stream buffering restart
#define JPEG_CR_RESTART_Msk			(0x01 << JPEG_CR_RESTART_Pos)
#define JPEG_CR_RESET_Pos			3		// JPEG DEC core reset, automatically clear
#define JPEG_CR_RESET_Msk			(0x01 << JPEG_CR_RESET_Pos)
#define JPEG_CR_REINTRV_Pos			4		// Restart interval marker enable
#define JPEG_CR_REINTRV_Msk			(0x01 << JPEG_CR_REINTRV_Pos)
#define JPEG_CR_LASTBUF_Pos			5		// Decoder last stream buffering
#define JPEG_CR_LASTBUF_Msk			(0x01 << JPEG_CR_LASTBUF_Pos)
#define JPEG_CR_QTAUTO_Pos			7		// JPEG quantization tables auto refresh enable
#define JPEG_CR_QTAUTO_Msk			(0x01 << JPEG_CR_QTAUTO_Pos)
#define JPEG_CR_HTAUTO_Pos			8		// JPEG huffman tables auto refresh enable
#define JPEG_CR_HTAUTO_Msk			(0x01 << JPEG_CR_HTAUTO_Pos)
#define JPEG_CR_QTCNT_Pos			9		// Number of quantization tables
#define JPEG_CR_QTCNT_Msk			(0x03 << JPEG_CR_QTCNT_Pos)
#define JPEG_CR_HTCNT_Pos			11		// Number of huffman tables
#define JPEG_CR_HTCNT_Msk			(0x01 << JPEG_CR_HTCNT_Pos)
#define JPEG_CR_CUCNT_Pos			12		// The number of CU in the restart interval
#define JPEG_CR_CUCNT_Msk			(0xFFFF<<JPEG_CR_CUCNT_Pos)

#define JPEG_IR_IEDONE_Pos			0		// Frame processing finish interrupt enable
#define JPEG_IR_IEDONE_Msk			(0x01 << JPEG_IR_IEDONE_Pos)
#define JPEG_IR_IEEMPTY_Pos			2		// JPEG decoder stream buffering empty interrupt enable
#define JPEG_IR_IEEMPTY_Msk			(0x01 << JPEG_IR_IEEMPTY_Pos)
#define JPEG_IR_IEERROR_Pos			3		// JPEG error interrupt enable
#define JPEG_IR_IEERROR_Msk			(0x01 << JPEG_IR_IEERROR_Pos)
#define JPEG_IR_ICDONE_Pos			5		// Interrupt Clear, write-ongly
#define JPEG_IR_ICDONE_Msk			(0x01 << JPEG_IR_ICDONE_Pos)
#define JPEG_IR_ICEMPTY_Pos			7
#define JPEG_IR_ICEMPTY_Msk			(0x01 << JPEG_IR_ICEMPTY_Pos)
#define JPEG_IR_ICERROR_Pos			8
#define JPEG_IR_ICERROR_Msk			(0x01 << JPEG_IR_ICERROR_Pos)
#define JPEG_IR_IFDONE_Pos			10		// Interrupt Flag, read-only
#define JPEG_IR_IFDONE_Msk			(0x01 << JPEG_IR_IFDONE_Pos)
#define JPEG_IR_IFEMPTY_Pos			12
#define JPEG_IR_IFEMPTY_Msk			(0x01 << JPEG_IR_IFEMPTY_Pos)
#define JPEG_IR_IFERROR_Pos			13
#define JPEG_IR_IFERROR_Msk			(0x01 << JPEG_IR_IFERROR_Pos)

#define JPEG_SR_BUSY_Pos			0
#define JPEG_SR_BUSY_Msk			(0x01 << JPEG_SR_BUSY_Pos)
#define JPEG_SR_CUOVR_Pos			1		// JPEG CU run length overflow error
#define JPEG_SR_CUOVR_Msk			(0x01 << JPEG_SR_CUOVR_Pos)
#define JPEG_SR_REIMERR_Pos			2		// JPEG Restart interval marker error
#define JPEG_SR_REIMERR_Msk			(0x01 << JPEG_SR_REIMERR_Pos)
#define JPEG_SR_BUFBUSY_Pos			4		// JPEG decoder stream buffering status
#define JPEG_SR_BUFBUSY_Msk			(0x01 << JPEG_SR_BUFBUSY_Pos)
#define JPEG_SR_DMARDBUSY_Pos		5
#define JPEG_SR_DMARDBUSY_Msk		(0x01 << JPEG_SR_DMARDBUSY_Pos)
#define JPEG_SR_DMAWRBUSY_Pos		6
#define JPEG_SR_DMAWRBUSY_Msk		(0x01 << JPEG_SR_DMAWRBUSY_Pos)

#define JPEG_IMGSIZ_HPIX_Pos		0		// JPEG image width (minus 1)
#define JPEG_IMGSIZ_HPIX_Msk		(0x7FF<< JPEG_IMGSIZ_HPIX_Pos)
#define JPEG_IMGSIZ_VPIX_Pos		16		// JPEG image height (minus 1)
#define JPEG_IMGSIZ_VPIX_Msk		(0x7FF<< JPEG_IMGSIZ_VPIX_Pos)

#define JPEG_IMGSTR_RGBLINE_Pos		0		// number of words of RGB line width, XRGB888: img_width, RGB888: ceil(img_width*3/4), RGB565: ceil(img_width/2)
#define JPEG_IMGSTR_RGBLINE_Msk		(0xFFF<< JPEG_IMGSTR_RGBLINE_Pos)
#define JPEG_IMGSTR_YLINE_Pos		0		// number of words of Y line width, ceil(img_width/4)
#define JPEG_IMGSTR_YLINE_Msk		(0xFFF<< JPEG_IMGSTR_YLINE_Pos)
#define JPEG_IMGSTR_UVLINE_Pos		16		// number of words of UV line width, UV-planer 444: ceil(img_width/4)   UV-planar 420/422: ceil(img_width/8)
											//									 UV-semi planer 444: ceil(img_width/2)   UV-semi planer 420/422: ceil(img_width/4)
#define JPEG_IMGSTR_UVLINE_Msk		(0xFFF<< JPEG_IMGSTR_UVLINE_Pos)




typedef struct {
	__O  uint32_t CR;
	
	__I  uint32_t SR;
	
	union {
		__IO uint32_t IDIS;
	
		__IO uint32_t IFE;					// Interrupt Flag Enable
	};
	
	__IO uint32_t IF;
	
	__IO uint32_t CFG;
	
	__IO uint32_t SINP;						// Scaling & Sin parameter
	__IO uint32_t COSP;						// Scaling & Cos parameter
	
	__IO uint32_t SRC_TILE_POSX;
	__IO uint32_t SRC_TILE_POSY;
	__IO uint32_t DST_TILE_OFFX;			// Offset
	__IO uint32_t DST_TILE_OFFY;
	
	__IO uint32_t BGCOLOR;
	
	__IO uint32_t SRCBASE;
	__IO uint32_t SRCSIZE;
	__IO uint32_t SRCSTRIDE;
	
	__IO uint32_t DSTBASE;
	__IO uint32_t DSTSIZE;
	__IO uint32_t DSTSTRIDE;
} SRA_TypeDef;


#define SRA_CR_START_Pos			0
#define SRA_CR_START_Msk			(0x01 << SRA_CR_START_Pos)
#define SRA_CR_ABORT_Pos			1
#define SRA_CR_ABORT_Msk			(0x01 << SRA_CR_ABORT_Pos)

#define SRA_SR_BUSY_Pos				0
#define SRA_SR_BUSY_Msk				(0x01 << SRA_SR_BUSY_Pos)
#define SRA_SR_ABORT_Pos			1		// 1 Abort pending
#define SRA_SR_ABORT_Msk			(0x01 << SRA_SR_ABORT_Pos)

#define SRA_IFE_FRAME_Pos			0
#define SRA_IFE_FRAME_Msk			(0x01 << SRA_IFE_FRAME_Pos)
#define SRA_IFE_8LINE_Pos			1
#define SRA_IFE_8LINE_Msk			(0x01 << SRA_IFE_8LINE_Pos)
#define SRA_IFE_ROTERR_Pos			2
#define SRA_IFE_ROTERR_Msk			(0x01 << SRA_IFE_ROTERR_Pos)
#define SRA_IFE_BUSERR_Pos			3
#define SRA_IFE_BUSERR_Msk			(0x01 << SRA_IFE_BUSERR_Pos)

#define SRA_IDIS_FRAME_Pos			4
#define SRA_IDIS_FRAME_Msk			(0x01 << SRA_IDIS_FRAME_Pos)
#define SRA_IDIS_8LINE_Pos			5
#define SRA_IDIS_8LINE_Msk			(0x01 << SRA_IDIS_8LINE_Pos)
#define SRA_IDIS_ROTERR_Pos			6
#define SRA_IDIS_ROTERR_Msk			(0x01 << SRA_IDIS_ROTERR_Pos)
#define SRA_IDIS_BUSERR_Pos			7
#define SRA_IDIS_BUSERR_Msk			(0x01 << SRA_IDIS_BUSERR_Pos)

#define SRA_IF_FRAME_Pos			0
#define SRA_IF_FRAME_Msk			(0x01 << SRA_IF_FRAME_Pos)
#define SRA_IF_8LINE_Pos			1
#define SRA_IF_8LINE_Msk			(0x01 << SRA_IF_8LINE_Pos)
#define SRA_IF_ROTERR_Pos			2
#define SRA_IF_ROTERR_Msk			(0x01 << SRA_IF_ROTERR_Pos)
#define SRA_IF_BUSERR_Pos			3
#define SRA_IF_BUSERR_Msk			(0x01 << SRA_IF_BUSERR_Pos)

