ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define SRA_CFG_SRCFMT_Pos			0		// Source Format, 0 Monochrome 8-bit, 1 RGB565, 2 RGB888, 3 XRGB8888, 5 XARGB88565, 6 ARGB8565, 7 ARGB8888
#define SRA_CFG_SRCFMT_Msk			(0x07 << SRA_CFG_SRCFMT_Pos)
#define SRA_CFG_SRCRBSWAP_Pos		3		// Source R/B swap, 0 RGB, 1 BGR
#define SRA_CFG_SRCRBSWAP_Msk		(0x01 << SRA_CFG_SRCRBSWAP_Pos)
#define SRA_CFG_SRCXSWAP_Pos		4		// Source X swap, 0 XRGB, 1 RGBX
#define SRA_CFG_SRCXSWAP_Msk		(0x01 << SRA_CFG_SRCXSWAP_Pos)
#define SRA_CFG_DSTFMT_Pos			8		// Destination Format, 0 Monochrome 8-bit, 1 RGB565, 2 RGB888, 3 XRGB8888, 5 XARGB88565, 6 ARGB8565, 7 ARGB8888
#define SRA_CFG_DSTFMT_Msk			(0x07 << SRA_CFG_DSTFMT_Pos)
#define SRA_CFG_DSTRBSWAP_Pos		11		// Destination R/B swap, 0 RGB, 1 BGR
#define SRA_CFG_DSTRBSWAP_Msk		(0x01 << SRA_CFG_DSTRBSWAP_Pos)
#define SRA_CFG_DSTXSWAP_Pos		12		// Destination X swap, 0 XRGB, 1 RGBX
#define SRA_CFG_DSTXSWAP_Msk		(0x01 << SRA_CFG_DSTXSWAP_Pos)
#define SRA_CFG_ROTTYP_Pos			16		// Rotation Type, 0 normal rotation, 1 x-mirror, 2 y-mirror, 3 x-mirror + y-mirror
#define SRA_CFG_ROTTYP_Msk			(0x03 << SRA_CFG_ROTTYP_Pos)
#define SRA_CFG_ROTAAEN_Pos			18		// Rotation Anti-aliasing enable
#define SRA_CFG_ROTAAEN_Msk			(0x01 << SRA_CFG_ROTAAEN_Pos)
#define SRA_CFG_ALPHADIS_Pos		19		// Pixel alpha disable for ARGB format, fixed to 0xFF
#define SRA_CFG_ALPHADIS_Msk		(0x01 << SRA_CFG_ALPHADIS_Pos)
#define SRA_CFG_BLENDBG_Pos			20		// 0 blend source and destination, 1 blend source and background color
#define SRA_CFG_BLENDBG_Msk			(0x01 << SRA_CFG_BLENDBG_Pos)
#define SRA_CFG_DUMMYWB_Pos			21		// background color write-back enable for dummy tile
#define SRA_CFG_DUMMYWB_Msk			(0x01 << SRA_CFG_DUMMYWB_Pos)

#define SRA_SINP_SINX_Pos			0		// sin(theta) * X scaling factor
#define SRA_SINP_SINX_Msk			(0xFFFF << SRA_SINP_SINX_Pos)
#define SRA_SINP_SINY_Pos			16		// sin(theta) * Y scaling factor
#define SRA_SINP_SINY_Msk			(0xFFFFu<< SRA_SINP_SINY_Pos)

#define SRA_COSP_COSX_Pos			0		// cos(theta) * X scaling factor
#define SRA_COSP_COSX_Msk			(0xFFFF << SRA_COSP_COSX_Pos)
#define SRA_COSP_COSY_Pos			16		// cos(theta) * Y scaling factor
#define SRA_COSP_COSY_Msk			(0xFFFFu<< SRA_COSP_COSY_Pos)

#define SRA_SRCSIZE_WIDTH_Pos		0
#define SRA_SRCSIZE_WIDTH_Msk		(0x7FFF << SRA_SRCSIZE_WIDTH_Pos)
#define SRA_SRCSIZE_HEIGHT_Pos		16
#define SRA_SRCSIZE_HEIGHT_Msk		(0x7FFF << SRA_SRCSIZE_HEIGHT_Pos)

#define SRA_DSTSIZE_WIDTH_Pos		0
#define SRA_DSTSIZE_WIDTH_Msk		(0x7FFF << SRA_DSTSIZE_WIDTH_Pos)
#define SRA_DSTSIZE_HEIGHT_Pos		16
#define SRA_DSTSIZE_HEIGHT_Msk		(0x7FFF << SRA_DSTSIZE_HEIGHT_Pos)




typedef struct {
	__IO uint32_t CR;
	
	__IO uint32_t IE;
	
	__IO uint32_t IF;
	
	__IO uint32_t ICFG;						// Interrupt config register
	
	__IO uint32_t INPOL;					// Input signal polarity
	
	__I  uint32_t INHSZ;					// Input horizontal size register
	
	__I  uint32_t INVSZ;					// Input vertical size register
	
	__IO uint32_t OUTHSZ;					// Output horizontal size register
	
	__IO uint32_t OUTVSZ;					// Output vertical size register
	
	__IO uint32_t OUTCFG;					// Output config register
	
	__I  uint32_t CURFRM;					// Output current frame number, 0 1 frame, 1 2 frames, ...
	
	__IO uint32_t OUTCR;					// Output control register
	
	__IO uint32_t UPDATE;					// write 1 to update BASE_YRAW, BASE_UV, STEP_YRAW, STEP_UV to internal working register
	
	__IO uint32_t BASE_YRAW;				// base address of Y/RAW data frame buffer, should be word aligned
	
	__IO uint32_t BASE_UV;					// base address of UV data frame buffer, should be word aligned
	
	__I  uint32_t ADDR_YRAW;				// current writing address of Y/RAW data frame buffer (for debug)
	
	__I  uint32_t ADDR_UV;					// current writing address of UV data frame buffer (for debug)
	
	__IO uint32_t STEP_YRAW;				// line stride of Y/RAW data (bytes), should be multiple of 8
	
	__IO uint32_t STEP_UV;					// line stride of UV data (bytes), should be multiple of 8
	
	__I  uint32_t BASE_YRAW_SHA;			// BASE_YRAW shadow register
	
	__I  uint32_t BASE_UV_SHA;				// BASE_UV shadow register
	
	__I  uint32_t STEP_SHA;					// bit31..16 is STEP_YRAW shadow, bit15..0 is STEP_UV shadow
} DVP_TypeDef;


#define DVP_CR_ENA_Pos				0		// DVP mode enable
#define DVP_CR_ENA_Msk				(0x01 << DVP_CR_ENA_Pos)
#define DVP_CR_CLR_Pos				1		// write 1 to reset buffer address, auto clear
#define DVP_CR_CLR_Msk				(0x01 << DVP_CR_CLR_Pos)
#define DVP_CR_DROPEN_Pos			2		// 1 frames could be dropped if no time for data writing back.
#define DVP_CR_DROPEN_Msk			(0x01 << DVP_CR_DROPEN_Pos)
#define DVP_CR_CONTEN_Pos			3		// 1 video continuous capture enable
#define DVP_CR_CONTEN_Msk			(0x01 << DVP_CR_CONTEN_Pos)
#define DVP_CR_INFMT_Pos			4		// input format, 0 RAW/RGB565, 1 YUV422 8-bit, 2 BT656
#define DVP_CR_INFMT_Msk			(0x07 << DVP_CR_INFMT_Pos)
#define DVP_CR_INSEQ_Pos			8		// YUV data input sequence, 0 YUYV, 1 YVYU, 2 UYVY, 3 VYUV
#define DVP_CR_INSEQ_Msk			(0x03 << DVP_CR_INSEQ_Pos)
#define DVP_CR_INSWAP_Pos			10		// RAW data input swap, 0 no swap, 1 even/odd byte swap
#define DVP_CR_INSWAP_Msk			(0x01 << DVP_CR_INSWAP_Pos)
#define DVP_CR_FIELDSTM_Pos			11		// Field Store Mode, 0 normal mode (field by field), 1 field line interleaving mode (line by line)
#define DVP_CR_FIELDSTM_Msk			(0x01 << DVP_CR_FIELDSTM_Pos)
#define DVP_CR_OUTFMT_Pos			12		// DVP output format, 0 RAW/RGB565, 1 YUV422 NV16, 2 YUV420 NV12, 3 RGB565, 4 RGB888, 5 RGBX888
#define DVP_CR_OUTFMT_Msk			(0x07 << DVP_CR_OUTFMT_Pos)
#define DVP_CR_RAWBIT_Pos			15		// RAW data bit width, 0 8-bit, 1 10-bit, 2 12-bit, 3 14-bit
#define DVP_CR_RAWBIT_Msk			(0x03 << DVP_CR_RAWBIT_Pos)
#define DVP_CR_RBSWAP_Pos			17		// RGB output read and blue swap
#define DVP_CR_RBSWAP_Msk			(0x01 << DVP_CR_RBSWAP_Pos)
#define DVP_CR_YUVRANGE_Pos			18		// 0 16-235, 1 0-255
#define DVP_CR_YUVRANGE_Msk			(0x01 << DVP_CR_YUVRANGE_Pos)

#define DVP_IE_DONE_Pos				0		// all frames captured done interrupt enable
#define DVP_IE_DONE_Msk				(0x01 << DVP_IE_DONE_Pos)
#define DVP_IE_FRAME_Pos			1		// one frame captured done interrupt enable
#define DVP_IE_FRAME_Msk			(0x01 << DVP_IE_FRAME_Pos)
#define DVP_IE_LINES_Pos			2		// specified number of lines captured done interrupt enable
#define DVP_IE_LINES_Msk			(0x01 << DVP_IE_LINES_Pos)
#define DVP_IE_BUFULL_Pos			3		// output buffer full interrupt enable
#define DVP_IE_BUFULL_Msk			(0x01 << DVP_IE_BUFULL_Pos)
#define DVP_IE_HSZCHG_Pos			4		// input horizontal size change interrupt enable
#define DVP_IE_HSZCHG_Msk			(0x01 << DVP_IE_HSZCHG_Pos)
#define DVP_IE_VSZCHG_Pos			5		// input vertical size change interrupt enable
#define DVP_IE_VSZCHG_Msk			(0x01 << DVP_IE_VSZCHG_Pos)
#define DVP_IE_CODERR_Pos			6		// XY code error interrupt enable
#define DVP_IE_CODERR_Msk			(0x01 << DVP_IE_CODERR_Pos)
#define DVP_IE_UPDATE_Pos			7		// output address update done interrupt enable
#define DVP_IE_UPDATE_Msk			(0x01 << DVP_IE_UPDATE_Pos)

