ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define DVP_IF_DONE_Pos				0		// write 1 to clear
#define DVP_IF_DONE_Msk				(0x01 << DVP_IF_DONE_Pos)
#define DVP_IF_FRAME_Pos			1
#define DVP_IF_FRAME_Msk			(0x01 << DVP_IF_FRAME_Pos)
#define DVP_IF_LINES_Pos			2
#define DVP_IF_LINES_Msk			(0x01 << DVP_IF_LINES_Pos)
#define DVP_IF_BUFULL_Pos			3
#define DVP_IF_BUFULL_Msk			(0x01 << DVP_IF_BUFULL_Pos)
#define DVP_IF_HSZCHG_Pos			4
#define DVP_IF_HSZCHG_Msk			(0x01 << DVP_IF_HSZCHG_Pos)
#define DVP_IF_VSZCHG_Pos			5
#define DVP_IF_VSZCHG_Msk			(0x01 << DVP_IF_VSZCHG_Pos)
#define DVP_IF_CODERR_Pos			6
#define DVP_IF_CODERR_Msk			(0x01 << DVP_IF_CODERR_Pos)
#define DVP_IF_UPDATE_Pos			7
#define DVP_IF_UPDATE_Msk			(0x01 << DVP_IF_UPDATE_Pos)

#define DVP_ICFG_LINES_Pos			16		// input horizontal done (HREF falling edge) number for interrupt
#define DVP_ICFG_LINES_Msk			(0x7FFF << DVP_ICFG_LINES_Pos)

#define DVP_INPOL_PCLK_Pos			0		// 0 sample on rising edge
#define DVP_INPOL_PCLK_Msk			(0x01 << DVP_INPOL_PCLK_Pos)
#define DVP_INPOL_HREF_Pos			1		// 0 active high (rising edge)
#define DVP_INPOL_HREF_Msk			(0x01 << DVP_INPOL_HREF_Pos)
#define DVP_INPOL_VSYNC_Pos			2		// 0 active high (rising edge)
#define DVP_INPOL_VSYNC_Msk			(0x01 << DVP_INPOL_VSYNC_Pos)
#define DVP_INPOL_FIELD_Pos			3		// 0 active high
#define DVP_INPOL_FIELD_Msk			(0x01 << DVP_INPOL_FIELD_Pos)

#define DVP_INHSZ_CODE_Pos			0		// current input XY code
#define DVP_INHSZ_CODE_Msk			(0xFF << DVP_INHSZ_CODE_Pos)
#define DVP_INHSZ_CODERR_Pos		8		// input XY code when error
#define DVP_INHSZ_CODERR_Msk		(0xFF << DVP_INHSZ_CODERR_Pos)
#define DVP_INHSZ_PIXELS_Pos		16		// pixels per line
#define DVP_INHSZ_PIXELS_Msk		(0x7FFF << DVP_INHSZ_PIXELS_Pos)

#define DVP_INVSZ_LINE_Pos			0		// current line number
#define DVP_INVSZ_LINE_Msk			(0x7FFF << DVP_INVSZ_LINE_Pos)
#define DVP_INVSZ_FIELD_Pos			15		// current field
#define DVP_INVSZ_FIELD_Msk			(0x01 << DVP_INVSZ_FIELD_Pos)
#define DVP_INVSZ_LINES_Pos			16		// lines per frame
#define DVP_INVSZ_LINES_Msk			(0x7FFF << DVP_INVSZ_LINES_Pos)

#define DVP_OUTHSZ_BEGIN_Pos		0		// start position of horizontal data
#define DVP_OUTHSZ_BEGIN_Msk		(0x3FFF << DVP_OUTHSZ_BEGIN_Pos)
#define DVP_OUTHSZ_COUNT_Pos		16		// pixel count to be captured
#define DVP_OUTHSZ_COUNT_Msk		(0x3FFF << DVP_OUTHSZ_COUNT_Pos)

#define DVP_OUTVSZ_BEGIN_Pos		0		// start position of vertical line
#define DVP_OUTVSZ_BEGIN_Msk		(0x3FFF << DVP_OUTVSZ_BEGIN_Pos)
#define DVP_OUTVSZ_COUNT_Pos		16		// line count to be captured
#define DVP_OUTVSZ_COUNT_Msk		(0x3FFF << DVP_OUTVSZ_COUNT_Pos)

#define DVP_OUTCFG_FRAME_Pos		0		// start frame to be captured
#define DVP_OUTCFG_FRAME_Msk		(0x3FFF << DVP_OUTCFG_FRAME_Pos)
#define DVP_OUTCFG_FIELD_Pos		15		// start field to be captured, 0 field 0, 1 field 1
#define DVP_OUTCFG_FIELD_Msk		(0x01 << DVP_OUTCFG_FIELD_Pos)
#define DVP_OUTCFG_COUNT_Pos		16		// frame count to be captured
#define DVP_OUTCFG_COUNT_Msk		(0x3FFF << DVP_OUTCFG_COUNT_Pos)
#define DVP_OUTCFG_VIDEO_Pos		31		// capture mode, 0 snapshot, 1 video
#define DVP_OUTCFG_VIDEO_Msk		(0x01 << DVP_OUTCFG_VIDEO_Pos)

#define DVP_OUTCR_CAPON_Pos			0		// 1 capture start, 0 capture stop
#define DVP_OUTCR_CAPON_Msk			(0x01 << DVP_OUTCR_CAPON_Pos)
#define DVP_OUTCR_OFFMODE_Pos		1		// 0 capture stop after current frame, 1 capture stop immediately
#define DVP_OUTCR_OFFMODE_Msk		(0x01 << DVP_OUTCR_OFFMODE_Pos)
#define DVP_OUTCR_DMABUSY_Pos		2
#define DVP_OUTCR_DMABUSY_Msk		(0x01 << DVP_OUTCR_DMABUSY_Pos)
#define DVP_OUTCR_BUSBUSY_Pos		3
#define DVP_OUTCR_BUSBUSY_Msk		(0x01 << DVP_OUTCR_BUSBUSY_Pos)
#define DVP_OUTCR_BUSERR_Pos		4
#define DVP_OUTCR_BUSERR_Msk		(0x01 << DVP_OUTCR_BUSERR_Pos)




typedef struct {
	__IO uint32_t DATA;
	
	__IO uint32_t ADDR;
	
	__IO uint32_t ERASE;
	
	__IO uint32_t CACHE;
	
	__IO uint32_t CFG0;
	
	__IO uint32_t CFG1;						// 依次写入 0x5A5A5A5A、0xA5A5A5A5 解除 readonly，写其他值恢复 readonly
	
	__IO uint32_t CFG2;
	
	__IO uint32_t CFG3;
	
	__IO uint32_t CFG4;
	
	__IO uint32_t STAT;
} FMC_TypeDef;


#define FMC_ERASE_ADDR_Pos			0		// 高10位有效，1K每页
#define FMC_ERASE_ADDR_Msk			(0xFFFFF << FMC_ERASE_ADDR_Pos)
#define FMC_ERASE_REQ_Pos			24
#define FMC_ERASE_REQ_Msk			(0xFFu<< FMC_ERASE_REQ_Pos)

#define FMC_CACHE_CEN_Pos			0		// Cache Enable
#define FMC_CACHE_CEN_Msk			(0x01 << FMC_CACHE_CEN_Pos)
#define FMC_CACHE_CPEN_Pos			1		// Cache Predict Enable
#define FMC_CACHE_CPEN_Msk			(0x01 << FMC_CACHE_CPEN_Pos)
#define FMC_CACHE_CCLR_Pos			31		// Cache Clear，自动清零
#define FMC_CACHE_CCLR_Msk			(0x01u<< FMC_CACHE_CCLR_Pos)

#define FMC_CFG0_WREN_Pos			9		// 擦写使能
#define FMC_CFG0_WREN_Msk			(0x01 << FMC_CFG0_WREN_Pos)

#define FMC_STAT_ERASEBUSY_Pos		0
#define FMC_STAT_ERASEBUSY_Msk		(0x01 << FMC_STAT_ERASEBUSY_Pos)
#define FMC_STAT_PROGBUSY_Pos		1
#define FMC_STAT_PROGBUSY_Msk		(0x01 << FMC_STAT_PROGBUSY_Pos)
#define FMC_STAT_READBUSY_Pos		2
#define FMC_STAT_READBUSY_Msk		(0x01 << FMC_STAT_READBUSY_Pos)
#define FMC_STAT_FIFOEMPTY_Pos		3		// Write FIFO Empty
#define FMC_STAT_FIFOEMPTY_Msk		(0x01 << FMC_STAT_FIFOEMPTY_Pos)
#define FMC_STAT_FIFOFULL_Pos		4		// Write FIFO Full
#define FMC_STAT_FIFOFULL_Msk		(0x01 << FMC_STAT_FIFOFULL_Pos)
#define FMC_STAT_IDLE_Pos			31
#define FMC_STAT_IDLE_Msk			(0x01u<< FMC_STAT_IDLE_Pos)




typedef struct {
	__IO uint32_t CR;
	
	__I  uint32_t SR;
	
		 uint32_t RESERVED;
	
	__IO uint32_t DHR;
} DAC_TypeDef;


#define DAC_CR_EN_Pos				0
#define DAC_CR_EN_Msk				(0x01 << DAC_CR_EN_Pos)
#define DAC_CR_DHRFMT_Pos			9		// DHR Format, 0 12-bit data, DHR[11:0] => DOR[11:0]; 1 12-bit data, DHR[15:4] => DOR[11:0]; 3 8-bit data, DHR[7 :0] => DOR[11:4]
#define DAC_CR_DHRFMT_Msk			(0x03 << DAC_CR_DHRFMT_Pos)
#define DAC_CR_BUFOFF_Pos			11		// 0 buffer on, 1 buffer off
#define DAC_CR_BUFOFF_Msk			(0x01 << DAC_CR_BUFOFF_Pos)
#define DAC_CR_REFSEL_Pos			12		// reference select, 0 VDD, 1 Vrefp
#define DAC_CR_REFSEL_Msk			(0x01 << DAC_CR_REFSEL_Pos)

