ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define DAC_SR_DHRFULL_Pos			0		// 0 DHR not Full, can write now
#define DAC_SR_DHRFULL_Msk			(0x01 << DAC_SR_DHRFULL_Pos)




typedef struct {
    __IO uint32_t CR;
    
	__O  uint32_t DATAIN;
	
    __IO uint32_t INIVAL;					// inital value, be written to RESULT when write 1 to CR.EN
    
    __I  uint32_t RESULT;
} CRC_TypeDef;


#define CRC_CR_EN_Pos			    0
#define CRC_CR_EN_Msk			    (0x01 << CRC_CR_EN_Pos)
#define CRC_CR_IREV_Pos				1       // input data reverse enable, 0 bit order not change, 1 bit order completely reverse, 2 bit order intra-byte reverse, 3 byte order reverse
#define CRC_CR_IREV_Msk				(0x03 << CRC_CR_IREV_Pos)
#define CRC_CR_INOT_Pos				3       // input data inverse enable
#define CRC_CR_INOT_Msk				(0x01 << CRC_CR_INOT_Pos)
#define CRC_CR_OREV_Pos				4       // output data reverse enable
#define CRC_CR_OREV_Msk				(0x03 << CRC_CR_OREV_Pos)
#define CRC_CR_ONOT_Pos				6       // output data inverse enable
#define CRC_CR_ONOT_Msk				(0x01 << CRC_CR_ONOT_Pos)
#define CRC_CR_POLY_Pos				7       // CRC polynomial, 0 x^16+x^12+x^5+1, 1 x^8+x^2+x+1, 2 x^16+x^15+x^2+1, 3 x^32+x^26+x^23+x^22+x^16+x^12+x^11+x^10+x^8+x^7+x^5+x^4+x^2+x+1
#define CRC_CR_POLY_Msk				(0x03 << CRC_CR_POLY_Pos)
#define CRC_CR_IBIT_Pos				9       // input data width, 0 32-bit, 1 16-bit, 2 8-bit
#define CRC_CR_IBIT_Msk				(0x03 << CRC_CR_IBIT_Pos)




typedef struct {
    __IO uint32_t TR;                   	// time register
    
    __IO uint32_t DR;                   	// date register
    
    __IO uint32_t CR;                   	// control register
    
    __IO uint32_t SR;                     	// status register
    
    __IO uint32_t CKDIV;                 	// clock divide
    
    __IO uint32_t WKTIM;                 	// wakeup time
    
    __IO uint32_t CALIBH;                   // rough calibration
    
    __IO uint32_t ALRMA;					// alarm A
    
    __IO uint32_t ALRMB;                	// alarm B
    
    __IO uint32_t UNLOCK;                  	// unlock register, write 0xCA and 0x53 to remove register write protection
    
    __I  uint32_t SUBSEC;                  	// sub second
    
    __IO uint32_t SHIFTR;                 	// shift control register
    
    __I  uint32_t TSTR;                    	// timestamp time register
	
	__I  uint32_t TSDR;						// timestamp date register
	
	__I  uint32_t TSSS;						// timestamp sub second
	
	__IO uint32_t CALIBL;					// precise calibration
	
	__IO uint32_t TAMPER;					// tamper configuration
	
	__IO uint32_t ALRMASS;					// alarm A sub second
	
	__IO uint32_t ALRMBSS;					// alram B sub second
	
	__I  uint32_t RESERVED;
	
	__IO uint32_t BACKUP[20];
	
	__I  uint32_t RESERVED2;
	
	__IO uint32_t LVRCR;
	
	__IO uint32_t X32KCR;					// 32.768 KHz crystal control
	
	__IO uint32_t PWRCR;
} RTC_TypeDef;


#define RTC_TR_SEC_Pos             	0		// Second units in BCD format
#define RTC_TR_SEC_Msk             	(0x0F << RTC_TR_SEC_Pos)
#define RTC_TR_SEC10_Pos            4		// Second tens in BCD format
#define RTC_TR_SEC10_Msk            (0x07 << RTC_TR_SEC10_Pos)
#define RTC_TR_MIN_Pos             	8
#define RTC_TR_MIN_Msk             	(0x0F << RTC_TR_MIN_Pos)
#define RTC_TR_MIN10_Pos            12
#define RTC_TR_MIN10_Msk            (0x07 << RTC_TR_MIN10_Pos)
#define RTC_TR_HOUR_Pos             16
#define RTC_TR_HOUR_Msk             (0x0F << RTC_TR_HOUR_Pos)
#define RTC_TR_HOUR10_Pos         	20
#define RTC_TR_HOUR10_Msk           (0x03 << RTC_TR_HOUR10_Pos)
#define RTC_TR_PM_Pos         		22		// 0 AM, 1 PM
#define RTC_TR_PM_Msk           	(0x01 << RTC_TR_PM_Pos)

#define RTC_DR_DATE_Pos            	0
#define RTC_DR_DATE_Msk           	(0x0F << RTC_DR_DATE_Pos)
#define RTC_DR_DATE10_Pos           4
#define RTC_DR_DATE10_Msk           (0x03 << RTC_DR_DATE10_Pos)
#define RTC_DR_MON_Pos              8
#define RTC_DR_MON_Msk              (0x0F << RTC_DR_MON_Pos)
#define RTC_DR_MON10_Pos            12
#define RTC_DR_MON10_Msk            (0x01 << RTC_DR_MON10_Pos)
#define RTC_DR_DAY_Pos              13      // 1 Monday, ..., 7 Sunday
#define RTC_DR_DAY_Msk              (0x07 << RTC_DR_DAY_Pos)
#define RTC_DR_YEAR_Pos             16
#define RTC_DR_YEAR_Msk             (0x0F << RTC_DR_YEAR_Pos)
#define RTC_DR_YEAR10_Pos           20
#define RTC_DR_YEAR10_Msk           (0x0F << RTC_DR_YEAR10_Pos)

#define RTC_CR_WKCLK_Pos            0       // wakeup clock source, 0 RTC_CLK/16, 1 RTC_CLK/8, 2 RTC_CLK/4, 3 RTC_CLK/2, 4 CK_SDIV
#define RTC_CR_WKCLK_Msk            (0x07 << RTC_CR_WKCLK_Pos)
#define RTC_CR_TSEDGE_Pos           3       // timestamp edge, 0 rise edge, 1 fall edge
#define RTC_CR_TSEDGE_Msk           (0x01 << RTC_CR_TSEDGE_Pos)
#define RTC_CR_REFCLK_Pos           4       // reference clock
#define RTC_CR_REFCLK_Msk           (0x01 << RTC_CR_REFCLK_Pos)
#define RTC_CR_BYPSHAD_Pos          5       // bypass shadow register for DR/TR/SUBSEC
#define RTC_CR_BYPSHAD_Msk          (0x01 << RTC_CR_BYPSHAD_Pos)
#define RTC_CR_FMT12_Pos            6       // 0 24 hour/day format, 1 AM/PM hour format
#define RTC_CR_FMT12_Msk            (0x01 << RTC_CR_FMT12_Pos)
#define RTC_CR_DCEN_Pos             7       // digial calibration enable
#define RTC_CR_DCEN_Msk             (0x01 << RTC_CR_DCEN_Pos)
#define RTC_CR_ALRAEN_Pos           8       // alarm A enable
#define RTC_CR_ALRAEN_Msk           (0x01 << RTC_CR_ALRAEN_Pos)
#define RTC_CR_ALRBEN_Pos           9       // alarm B enable
#define RTC_CR_ALRBEN_Msk           (0x01 << RTC_CR_ALRBEN_Pos)
#define RTC_CR_WKUPEN_Pos           10      // wakeup enable
#define RTC_CR_WKUPEN_Msk           (0x01 << RTC_CR_WKUPEN_Pos)
#define RTC_CR_TSEN_Pos             11      // timestamp enable
#define RTC_CR_TSEN_Msk             (0x01 << RTC_CR_TSEN_Pos)
#define RTC_CR_ALRAIE_Pos           12      // alarm A interrupt enable
#define RTC_CR_ALRAIE_Msk           (0x01 << RTC_CR_ALRAIE_Pos)
#define RTC_CR_ALRBIE_Pos           13      // alarm B interrupt enable
#define RTC_CR_ALRBIE_Msk           (0x01 << RTC_CR_ALRBIE_Pos)
#define RTC_CR_WKUPIE_Pos           14      // wakeup interrupt enable
#define RTC_CR_WKUPIE_Msk           (0x01 << RTC_CR_WKUPIE_Pos)
#define RTC_CR_TSIE_Pos             15      // timestamp interrupt enable
#define RTC_CR_TSIE_Msk             (0x01 << RTC_CR_TSIE_Pos)
#define RTC_CR_ADD1H_Pos            16      // add 1 hour (summer time change)
#define RTC_CR_ADD1H_Msk            (0x01 << RTC_CR_ADD1H_Pos)
#define RTC_CR_SUB1H_Pos            17      // sub 1 hour (winter time change)
#define RTC_CR_SUB1H_Msk            (0x01 << RTC_CR_SUB1H_Pos)
#define RTC_CR_BKP1H_Pos            18      // can be written by the user to memorize whether the daylight saving time change has been performed or not.
#define RTC_CR_BKP1H_Msk            (0x01 << RTC_CR_BKP1H_Pos)
#define RTC_CR_COSEL_Pos            19      // calibration output select
#define RTC_CR_COSEL_Msk            (0x01 << RTC_CR_COSEL_Pos)
#define RTC_CR_AOPOL_Pos            20      // alarm output polarity
#define RTC_CR_AOPOL_Msk            (0x01 << RTC_CR_AOPOL_Pos)
#define RTC_CR_AOSEL_Pos            21      // alarm output select
#define RTC_CR_AOSEL_Msk            (0x03 << RTC_CR_AOSEL_Pos)
#define RTC_CR_COEN_Pos             23      // calibration output enable
#define RTC_CR_COEN_Msk             (0x01 << RTC_CR_COEN_Pos)

#define RTC_SR_ALRAWEN_Pos          0       // alarm A write enable
#define RTC_SR_ALRAWEN_Msk          (0x01 << RTC_SR_ALRAWEN_Pos)
#define RTC_SR_ALRBWEN_Pos          1       // alarm B write enable
#define RTC_SR_ALRBWEN_Msk          (0x01 << RTC_SR_ALRBWEN_Pos)
#define RTC_SR_WKUPWEN_Pos          2       // wakeup write enable
#define RTC_SR_WKUPWEN_Msk          (0x01 << RTC_SR_WKUPWEN_Pos)
#define RTC_SR_SHIFTING_Pos         3       // shift in progress
#define RTC_SR_SHIFTING_Msk         (0x01 << RTC_SR_SHIFTING_Pos)
#define RTC_SR_INITRDY_Pos          4       // init ready/done
#define RTC_SR_INITRDY_Msk          (0x01 << RTC_SR_INITRDY_Pos)
#define RTC_SR_SYNCRDY_Pos          5       // sync ready, can read DR/TR/SUBSEC
#define RTC_SR_SYNCRDY_Msk          (0x01 << RTC_SR_SYNCRDY_Pos)
#define RTC_SR_INITWEN_Pos          6       // init write enable
#define RTC_SR_INITWEN_Msk          (0x01 << RTC_SR_INITWEN_Pos)
#define RTC_SR_INIT_Pos             7
#define RTC_SR_INIT_Msk             (0x01 << RTC_SR_INIT_Pos)
#define RTC_SR_ALRAF_Pos            8       // alarm A flag
#define RTC_SR_ALRAF_Msk            (0x01 << RTC_SR_ALRAF_Pos)
#define RTC_SR_ALRBF_Pos            9       // alarm B flag
#define RTC_SR_ALRBF_Msk            (0x01 << RTC_SR_ALRBF_Pos)
#define RTC_SR_WKUPF_Pos            10      // wakeup flag
#define RTC_SR_WKUPF_Msk            (0x01 << RTC_SR_WKUPF_Pos)
#define RTC_SR_TSF_Pos              11      // tiemstamp flag
#define RTC_SR_TSF_Msk              (0x01 << RTC_SR_TSF_Pos)
#define RTC_SR_TSOVF_Pos            12      // timestamp overflow flag
#define RTC_SR_TSOVF_Msk            (0x01 << RTC_SR_TSOVF_Pos)
#define RTC_SR_TAMPERF_Pos          13      // tamper flag
#define RTC_SR_TAMPERF_Msk          (0x01 << RTC_SR_TAMPERF_Pos)
#define RTC_SR_CALBING_Pos          16      // calibration in progress
#define RTC_SR_CALBING_Msk          (0x01 << RTC_SR_CALBING_Pos)

#define RTC_CKDIV_SDIV_Pos           0       // sync div, ck_sdiv = ck_adiv / (SDIV + 1)
#define RTC_CKDIV_SDIV_Msk           (0x7FFF<< RTC_CKDIV_SDIV_Pos)
#define RTC_CKDIV_ADIV_Pos           16      // async div, ck_adiv = RTC_CLK / (ADIV + 1)
#define RTC_CKDIV_ADIV_Msk           (0x7F << RTC_CKDIV_ADIV_Pos)

#define RTC_CALIBH_VALUE_Pos         0       // MINUS = 0, VALUE: 0 +0ppm, 1 +4ppm, ..., 31 +126ppm
#define RTC_CALIBH_VALUE_Msk         (0x1F << RTC_CALIBH_VALUE_Pos)
#define RTC_CALIBH_MINUS_Pos         7       // MINUS = 1, VALUE: 0 -0ppm, 1 -2ppm, ..., 31 -63ppm
#define RTC_CALIBH_MINUS_Msk         (0x01 << RTC_CALIBH_MINUS_Pos)

#define RTC_ALRMA_SEC_Pos           0
#define RTC_ALRMA_SEC_Msk           (0x0F << RTC_ALRMA_SEC_Pos)
#define RTC_ALRMA_SEC10_Pos         4
#define RTC_ALRMA_SEC10_Msk         (0x07 << RTC_ALRMA_SEC10_Pos)
#define RTC_ALRMA_SECMSK_Pos        7       //seconds mask, 1 Seconds don??t care in Alarm comparison
#define RTC_ALRMA_SECMSK_Msk        (0x01 << RTC_ALRMA_SECMSK_Pos)
#define RTC_ALRMA_MIN_Pos           8
#define RTC_ALRMA_MIN_Msk           (0x0F << RTC_ALRMA_MIN_Pos)
#define RTC_ALRMA_MIN10_Pos         12
#define RTC_ALRMA_MIN10_Msk         (0x07 << RTC_ALRMA_MIN10_Pos)
#define RTC_ALRMA_MINMSK_Pos        15
#define RTC_ALRMA_MINMSK_Msk        (0x01 << RTC_ALRMA_MINMSK_Pos)
#define RTC_ALRMA_HOUR_Pos          16
#define RTC_ALRMA_HOUR_Msk          (0x0F << RTC_ALRMA_HOUR_Pos)
#define RTC_ALRMA_HOUR10_Pos        20
#define RTC_ALRMA_HOUR10_Msk        (0x03 << RTC_ALRMA_HOUR10_Pos)
#define RTC_ALRMA_PM_Pos            22      // 0 AM, 1 PM
#define RTC_ALRMA_PM_Msk            (0x01 << RTC_ALRMA_PM_Pos)
#define RTC_ALRMA_HOURMSK_Pos       23
#define RTC_ALRMA_HOURMSK_Msk       (0x01 << RTC_ALRMA_HOURMSK_Pos)
#define RTC_ALRMA_DATE_Pos          24
#define RTC_ALRMA_DATE_Msk          (0x0F << RTC_ALRMA_DATE_Pos)
#define RTC_ALRMA_DATE10_Pos        28
#define RTC_ALRMA_DATE10_Msk        (0x03 << RTC_ALRMA_DATE10_Pos)
#define RTC_ALRMA_DAY_Pos           30      // 0 ALRMA.DATE represents the date units, 1 ALRMA.DATE represents the week day
#define RTC_ALRMA_DAY_Msk           (0x01 << RTC_ALRMA_DAY_Pos)
#define RTC_ALRMA_DATEMSK_Pos       31
#define RTC_ALRMA_DATEMSK_Msk       (0x01 << RTC_ALRMA_DATEMSK_Pos)

