ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#define RTC_ALRMB_SEC_Pos           0
#define RTC_ALRMB_SEC_Msk           (0x0F << RTC_ALRMB_SEC_Pos)
#define RTC_ALRMB_SEC10_Pos         4
#define RTC_ALRMB_SEC10_Msk         (0x07 << RTC_ALRMB_SEC10_Pos)
#define RTC_ALRMB_SECMSK_Pos        7
#define RTC_ALRMB_SECMSK_Msk        (0x01 << RTC_ALRMB_SECMSK_Pos)
#define RTC_ALRMB_MIN_Pos           8
#define RTC_ALRMB_MIN_Msk           (0x0F << RTC_ALRMB_MIN_Pos)
#define RTC_ALRMB_MIN10_Pos         12
#define RTC_ALRMB_MIN10_Msk         (0x07 << RTC_ALRMB_MIN10_Pos)
#define RTC_ALRMB_MINMSK_Pos        15
#define RTC_ALRMB_MINMSK_Msk        (0x01 << RTC_ALRMB_MINMSK_Pos)
#define RTC_ALRMB_HOUR_Pos          16
#define RTC_ALRMB_HOUR_Msk          (0x0F << RTC_ALRMB_HOUR_Pos)
#define RTC_ALRMB_HOUR10_Pos        20
#define RTC_ALRMB_HOUR10_Msk        (0x03 << RTC_ALRMB_HOUR10_Pos)
#define RTC_ALRMB_PM_Pos            22
#define RTC_ALRMB_PM_Msk            (0x01 << RTC_ALRMB_PM_Pos)
#define RTC_ALRMB_HOURMSK_Pos       23
#define RTC_ALRMB_HOURMSK_Msk       (0x01 << RTC_ALRMB_HOURMSK_Pos)
#define RTC_ALRMB_DATE_Pos          24
#define RTC_ALRMB_DATE_Msk          (0x0F << RTC_ALRMB_DATE_Pos)
#define RTC_ALRMB_DATE10_Pos        28
#define RTC_ALRMB_DATE10_Msk        (0x03 << RTC_ALRMB_DATE10_Pos)
#define RTC_ALRMB_DAY_Pos           30
#define RTC_ALRMB_DAY_Msk           (0x01 << RTC_ALRMB_DAY_Pos)
#define RTC_ALRMB_DATEMSK_Pos       31
#define RTC_ALRMB_DATEMSK_Msk       (0x01 << RTC_ALRMB_DATEMSK_Pos)

#define RTC_SHIFTR_SUBSS_Pos       	0      // sub-second value to sub
#define RTC_SHIFTR_SUBSS_Msk       	(0x7FFF<< RTC_SHIFTR_SUBSS_Pos)
#define RTC_SHIFTR_ADD1S_Pos       	31		// add 1 second
#define RTC_SHIFTR_ADD1S_Msk       	(0x01u<< RTC_SHIFTR_ADD1S_Pos)

#define RTC_TSTR_SEC_Pos            0
#define RTC_TSTR_SEC_Msk            (0x0F << RTC_TSTR_SEC_Pos)
#define RTC_TSTR_SEC10_Pos          4
#define RTC_TSTR_SEC10_Msk          (0x07 << RTC_TSTR_SEC10_Pos)
#define RTC_TSTR_MIN_Pos            8
#define RTC_TSTR_MIN_Msk            (0x0F << RTC_TSTR_MIN_Pos)
#define RTC_TSTR_MIN10_Pos          12
#define RTC_TSTR_MIN10_Msk          (0x07 << RTC_TSTR_MIN10_Pos)
#define RTC_TSTR_HOUR_Pos           16
#define RTC_TSTR_HOUR_Msk           (0x0F << RTC_TSTR_HOUR_Pos)
#define RTC_TSTR_HOUR10_Pos         20
#define RTC_TSTR_HOUR10_Msk         (0x03 << RTC_TSTR_HOUR10_Pos)
#define RTC_TSTR_PM_Pos             22
#define RTC_TSTR_PM_Msk             (0x01 << RTC_TSTR_PM_Pos)

#define RTC_TSDR_DATE_Pos           0
#define RTC_TSDR_DATE_Msk           (0x0F << RTC_TSDR_DATE_Pos)
#define RTC_TSDR_DATE10_Pos         4
#define RTC_TSDR_DATE10_Msk         (0x03 << RTC_TSDR_DATE10_Pos)
#define RTC_TSDR_MON_Pos            8
#define RTC_TSDR_MON_Msk            (0x0F << RTC_TSDR_MON_Pos)
#define RTC_TSDR_MON10_Pos          12
#define RTC_TSDR_MON10_Msk          (0x01 << RTC_TSDR_MON10_Pos)
#define RTC_TSDR_DAY_Pos            13
#define RTC_TSDR_DAY_Msk            (0x07 << RTC_TSDR_DAY_Pos)

#define RTC_CALIBL_CALM_Pos         0
#define RTC_CALIBL_CALM_Msk         (0x1FF<< RTC_CALIBL_CALM_Pos)
#define RTC_CALIBL_SEC16_Pos        13
#define RTC_CALIBL_SEC16_Msk        (0x01 << RTC_CALIBL_SEC16_Pos)
#define RTC_CALIBL_SEC8_Pos         14
#define RTC_CALIBL_SEC8_Msk         (0x01 << RTC_CALIBL_SEC8_Pos)
#define RTC_CALIBL_CALP_Pos         15
#define RTC_CALIBL_CALP_Msk         (0x01 << RTC_CALIBL_CALP_Pos)

#define RTC_TAMPER_ENA_Pos          0       // tamper detect enable
#define RTC_TAMPER_ENA_Msk          (0x01 << RTC_TAMPER_ENA_Pos)
#define RTC_TAMPER_POLAR_Pos        1		// 0 rise edge trigger tamper, 1 fall edge trigge tamper
#define RTC_TAMPER_POLAR_Msk        (0x01 << RTC_TAMPER_POLAR_Pos)
#define RTC_TAMPER_IE_Pos           2		// interrupt enable
#define RTC_TAMPER_IE_Msk           (0x01 << RTC_TAMPER_IE_Pos)
#define RTC_TAMPER_TSEN_Pos         7      // tamper gen timestamp enable
#define RTC_TAMPER_TSEN_Msk         (0x01 << RTC_TAMPER_TSEN_Pos)
#define RTC_TAMPER_SAMFREQ_Pos      8		// tamper sample frequency, 0 1-time per second, 1 2/s, ..., 7 128/s
#define RTC_TAMPER_SAMFREQ_Msk      (0x07 << RTC_TAMPER_SAMFREQ_Pos)
#define RTC_TAMPER_FILTER_Pos       11
#define RTC_TAMPER_FILTER_Msk       (0x03 << RTC_TAMPER_FILTER_Pos)
#define RTC_TAMPER_PRECHG_Pos       13		// Pull-up enable time prior to sampling. 0 1 RTCCLK period, 1 2 RTCCLK period, 2 4 RTCCLK period, 3 8 RTCCLK period
#define RTC_TAMPER_PRECHG_Msk       (0x03 << RTC_TAMPER_PRECHG_Pos)
#define RTC_TAMPER_PUPDIS_Pos       15		// Pull-up disable before sampling
#define RTC_TAMPER_PUPDIS_Msk       (0x01 << RTC_TAMPER_PUPDIS_Pos)
#define RTC_TAMPER_PIN_Pos          16		// tamper pin, 0 RTC_GPIO
#define RTC_TAMPER_PIN_Msk          (0x01 << RTC_TAMPER_PIN_Pos)
#define RTC_TAMPER_TSPIN_Pos        17		// timestamp trigger pin, 0 RTC_GPIO
#define RTC_TAMPER_TSPIN_Msk        (0x01 << RTC_TAMPER_TSPIN_Pos)
#define RTC_TAMPER_OUTPP_Pos        18		// RTC_ALARM out type, 0 open-drain, 1 push-pull
#define RTC_TAMPER_OUTPP_Msk        (0x01 << RTC_TAMPER_OUTPP_Pos)

#define RTC_ALRMASS_SUBSEC_Pos      0
#define RTC_ALRMASS_SUBSEC_Msk      (0x7FFF<< RTC_ALRMASS_SUBSEC_Pos)
#define RTC_ALRMASS_MASK_Pos        24
#define RTC_ALRMASS_MASK_Msk        (0x0F << RTC_ALRMASS_MASK_Pos)

#define RTC_ALRMBSS_SUBSEC_Pos      0
#define RTC_ALRMBSS_SUBSEC_Msk      (0x7FFF<< RTC_ALRMBSS_SUBSEC_Pos)
#define RTC_ALRMBSS_MASK_Pos        24
#define RTC_ALRMBSS_MASK_Msk        (0x0F << RTC_ALRMBSS_MASK_Pos)

#define RTC_LVRCR_ENA_Pos      		0
#define RTC_LVRCR_ENA_Msk      		(0x01 << RTC_LVRCR_ENA_Pos)
#define RTC_LVRCR_LVL_Pos      		1
#define RTC_LVRCR_LVL_Msk      		(0x03 << RTC_LVRCR_LVL_Pos)

#define RTC_X32KCR_ON_Pos           0
#define RTC_X32KCR_ON_Msk           (0x01 << RTC_X32KCR_ON_Pos)
#define RTC_X32KCR_IBST_Pos         1
#define RTC_X32KCR_IBST_Msk         (0x01 << RTC_X32KCR_IBST_Pos)
#define RTC_X32KCR_BYPS_Pos         2
#define RTC_X32KCR_BYPS_Msk         (0x01 << RTC_X32KCR_BYPS_Pos)

#define RTC_PWRCR_SLEEP_Pos         0
#define RTC_PWRCR_SLEEP_Msk         (0x01 << RTC_PWRCR_SLEEP_Pos)
#define RTC_PWRCR_STOP_Pos          1
#define RTC_PWRCR_STOP_Msk          (0x01 << RTC_PWRCR_STOP_Pos)
#define RTC_PWRCR_DEEPSLP_Pos       2
#define RTC_PWRCR_DEEPSLP_Msk       (0x01 << RTC_PWRCR_DEEPSLP_Pos)
#define RTC_PWRCR_CLKSRC_Pos        3		// 0 LRC 32KHz, 1 XTAL 32KHz
#define RTC_PWRCR_CLKSRC_Msk        (0x01 << RTC_PWRCR_CLKSRC_Pos)
#define RTC_PWRCR_LDO1V8_Pos		5		// 1.8V LDO enable
#define RTC_PWRCR_LDO1V8_Msk		(0x01 << RTC_PWRCR_LDO1V8_Pos)
#define RTC_PWRCR_BGTRIM_Pos        24
#define RTC_PWRCR_BGTRIM_Msk        (0x1F << RTC_PWRCR_BGTRIM_Pos)




