ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
typedef struct {
	__IO uint32_t RSTVAL;					// a reset occurs when the counter counts to this value
	
	__IO uint32_t INTVAL;					// an interrupt occurs when the counter counts to this value
	
	__IO uint32_t CR;
	
	__IO uint32_t IF;						// [0] interrupt flag, write 1 to clear
	
	__IO uint32_t FEED;						// write 0x55 to feed dog
} WDT_TypeDef;


#define WDT_CR_EN_Pos				0
#define WDT_CR_EN_Msk				(0x01 << WDT_CR_EN_Pos)
#define WDT_CR_RSTEN_Pos			1
#define WDT_CR_RSTEN_Msk			(0x01 << WDT_CR_RSTEN_Pos)
#define WDT_CR_INTEN_Pos			2
#define WDT_CR_INTEN_Msk			(0x01 << WDT_CR_INTEN_Pos)
#define WDT_CR_WINEN_Pos			3		// window function enable
#define WDT_CR_WINEN_Msk			(0x01 << WDT_CR_WINEN_Pos)
#define WDT_CR_CKDIV_Pos			8		// clock divider, 0 div2, 1 div4, 2 div8, ...
#define WDT_CR_CKDIV_Msk			(0x0F << WDT_CR_CKDIV_Pos)




/******************************************************************************/
/*						 Peripheral memory map							  */
/******************************************************************************/
#define RAM_BASE		   	0x20000000
#define AHB_BASE			0x40000000
#define APB1_BASE		 	0x40040000
#define APB2_BASE			0x400A0000

#define SFLASH_BASE			0x70000000	// Serial Flash
#define QSPI0_BASE			0x78000000
#define QSPI1_BASE			0x78000800

#define PSRAMM_BASE			0x80000000
#define PSRAMC_BASE			0x88000000


/* AHB Peripheral memory map */
#define SYS_BASE			(AHB_BASE + 0x00000)

#define DMA_BASE			(AHB_BASE + 0x00800)

#define SDIO_BASE			(AHB_BASE + 0x01000)

#define LCD_BASE		    (AHB_BASE + 0x01800)

#define CRC_BASE		    (AHB_BASE + 0x02000)

#define SRA_BASE			(AHB_BASE + 0x02800)

#define DMA2D_BASE			(AHB_BASE + 0x03000)

#define DVP_BASE			(AHB_BASE + 0x03900)

#define JPEG_BASE			(AHB_BASE + 0x04000)

#define RDMA_BASE			(AHB_BASE + 0x05000)


/* APB Peripheral memory map */
#define GPIOA_BASE			(APB1_BASE + 0x00000)
#define GPIOB_BASE			(APB1_BASE + 0x00800)
#define GPIOC_BASE			(APB1_BASE + 0x01000)
#define GPIOD_BASE			(APB1_BASE + 0x01800)

#define SPI0_BASE			(APB1_BASE + 0x02000)

#define I2S0_BASE			(APB1_BASE + 0x02800)

#define DAC0_BASE			(APB1_BASE + 0x03000)

#define ADC0_BASE			(APB1_BASE + 0x03800)

#define TIMR0_BASE			(APB1_BASE + 0x04000)
#define TIMR1_BASE			(APB1_BASE + 0x04040)
#define TIMRG_BASE			(APB1_BASE + 0x04400)

#define BTIMR0_BASE			(APB1_BASE + 0x04800)
#define BTIMR1_BASE			(APB1_BASE + 0x04840)
#define BTIMR2_BASE			(APB1_BASE + 0x04880)
#define BTIMR3_BASE			(APB1_BASE + 0x048C0)
#define BTIMRG_BASE			(APB1_BASE + 0x04C00)

#define PWM0_BASE			(APB1_BASE + 0x05000)
#define PWM1_BASE			(APB1_BASE + 0x05080)
#define PWMG_BASE			(APB1_BASE + 0x05400)

#define FMC_BASE			(APB1_BASE + 0x05800)	// Flash Memory Controller


#define PORTA_BASE			(APB2_BASE + 0x00000)
#define PORTB_BASE			(APB2_BASE + 0x00010)
#define PORTC_BASE			(APB2_BASE + 0x00020)
#define PORTD_BASE			(APB2_BASE + 0x00030)
#define PORTE_BASE			(APB2_BASE + 0x00040)

#define WDT_BASE			(APB2_BASE + 0x00800)

#define UART0_BASE			(APB2_BASE + 0x01000)
#define UART1_BASE			(APB2_BASE + 0x01800)
#define UART2_BASE			(APB2_BASE + 0x02000)
#define UART3_BASE			(APB2_BASE + 0x02800)
#define UART4_BASE			(APB2_BASE + 0x03000)

#define RTC_BASE			(APB2_BASE + 0x03800)

#define I2C0_BASE			(APB2_BASE + 0x04000)
#define I2C1_BASE			(APB2_BASE + 0x04800)

#define CAN0_BASE			(APB2_BASE + 0x05000)

#define GPIOE_BASE			(APB2_BASE + 0x06000)



/******************************************************************************/
/*						 Peripheral declaration							 */
/******************************************************************************/
#define SYS					((SYS_TypeDef  *) SYS_BASE)

#define PORTA				((PORT_TypeDef *) PORTA_BASE)
#define PORTB				((PORT_TypeDef *) PORTB_BASE)
#define PORTC				((PORT_TypeDef *) PORTC_BASE)
#define PORTD				((PORT_TypeDef *) PORTD_BASE)
#define PORTE				((PORT_TypeDef *) PORTE_BASE)

#define GPIOA				((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB				((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC				((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD				((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE				((GPIO_TypeDef *) GPIOE_BASE)

#define TIMR0				((TIMR_TypeDef *) TIMR0_BASE)
#define TIMR1				((TIMR_TypeDef *) TIMR1_BASE)
#define TIMRG				((TIMRG_TypeDef*) TIMRG_BASE)

#define BTIMR0				((TIMR_TypeDef *) BTIMR0_BASE)
#define BTIMR1				((TIMR_TypeDef *) BTIMR1_BASE)
#define BTIMR2				((TIMR_TypeDef *) BTIMR2_BASE)
#define BTIMR3				((TIMR_TypeDef *) BTIMR3_BASE)
#define BTIMRG				((TIMRG_TypeDef*) BTIMRG_BASE)

#define UART0				((UART_TypeDef *) UART0_BASE)
#define UART1				((UART_TypeDef *) UART1_BASE)
#define UART2				((UART_TypeDef *) UART2_BASE)
#define UART3   			((UART_TypeDef *) UART3_BASE)
#define UART4   			((UART_TypeDef *) UART4_BASE)

#define SPI0				((SPI_TypeDef  *) SPI0_BASE)

#define I2S0				((I2S_TypeDef  *) I2S0_BASE)

#define I2C0				((I2C_TypeDef  *) I2C0_BASE)
#define I2C1				((I2C_TypeDef  *) I2C1_BASE)

#define ADC0 				((ADC_TypeDef  *) ADC0_BASE)

#define PWM0				((PWM_TypeDef  *) PWM0_BASE)
#define PWM1				((PWM_TypeDef  *) PWM1_BASE)
#define PWMG				((PWMG_TypeDef *) PWMG_BASE)

#define DAC0				((DAC_TypeDef  *) DAC0_BASE)

#define DMA 				((DMA_TypeDef  *) DMA_BASE)

#define RDMA 				((RDMA_TypeDef *) RDMA_BASE)

#define CAN0 				((CAN_TypeDef  *) CAN0_BASE)

#define QSPI0				((QSPI_TypeDef *) QSPI0_BASE)
#define QSPI1				((QSPI_TypeDef *) QSPI1_BASE)

#define SDIO				((SDIO_TypeDef *) SDIO_BASE)

#define PSRAMC				((PSRAMC_TypeDef*)PSRAMC_BASE)

#define LCD					((LCD_TypeDef  *) LCD_BASE)

#define DMA2D				((DMA2D_TypeDef*) DMA2D_BASE)

#define JPEG				((JPEG_TypeDef *) JPEG_BASE)

#define SRA					((SRA_TypeDef  *) SRA_BASE)

#define DVP					((DVP_TypeDef  *) DVP_BASE)

#define FMC					((FMC_TypeDef  *) FMC_BASE)

#define CRC					((CRC_TypeDef  *) CRC_BASE)

#define RTC					((RTC_TypeDef  *) RTC_BASE)

#define WDT					((WDT_TypeDef  *) WDT_BASE)


