ZeHHHHH/SWM330_Lib/SWM330_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM330.h
#include "SWM330_port.h"
#include "SWM330_gpio.h"
#include "SWM330_exti.h"
#include "SWM330_timr.h"
#include "SWM330_uart.h"
#include "SWM330_spi.h"
#include "SWM330_i2s.h"
#include "SWM330_i2c.h"
#include "SWM330_adc.h"
#include "SWM330_pwm.h"
#include "SWM330_dma.h"
#include "SWM330_rdma.h"
#include "SWM330_can.h"
#include "SWM330_qspi.h"
#include "SWM330_sdio.h"
#include "SWM330_flash.h"
#include "SWM330_psram.h"
#include "SWM330_lcd.h"
#include "SWM330_dma2d.h"
#include "SWM330_jpeg.h"
#include "SWM330_sra.h"
#include "SWM330_dvp.h"
#include "SWM330_dac.h"
#include "SWM330_crc.h"
#include "SWM330_rtc.h"
#include "SWM330_wdt.h"




#ifdef  SW_LOG_RTT
#define log_printf(...)	 	SEGGER_RTT_printf(0, __VA_ARGS__)
#else
#define log_printf(...)	 	printf(__VA_ARGS__)
#endif


#ifndef SW_LOG_LEVEL
#define SW_LOG_LEVEL        0
#endif

#if (SW_LOG_LEVEL > 0)
#define SW_LOG_ERR(...)    	{						 \
							log_printf("ERROR: ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}

#if (SW_LOG_LEVEL > 1)
#define SW_LOG_WARN(...) 	{						 \
							log_printf("WARN : ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}

#if (SW_LOG_LEVEL > 2)
#define SW_LOG_INFO(...)   	{						 \
							log_printf("INFO : ");   \
							log_printf(__VA_ARGS__); \
							log_printf("\n");		 \
							}
#else
#define SW_LOG_INFO(...)
#endif

#else
#define SW_LOG_WARN(...)
#define SW_LOG_INFO(...)
#endif

#else
#define SW_LOG_ERR(...)
#define SW_LOG_WARN(...)
#define SW_LOG_INFO(...)
#endif


static __INLINE uint32_t SW_enter_critical(void)
{
	uint32_t primask = __get_PRIMASK();
	
	__disable_irq();
	
	return primask;
}

static __INLINE void SW_exit_critical(uint32_t primask)
{
	__set_PRIMASK(primask);
}


#endif //__SWM330_H__
